test/test_web/mutations/200-slice1/m1-remove-object-hasown-check.patch
--- a/data/setup.js
+++ b/data/setup.js
@@ -38,9 +38,7 @@ const resolve = ({ boardCapability = "", buildFlag = "", enabled = true, hasTog
       }
     }
     if (buildFlag) {
-      if (!identity?.build_flags || !Object.hasOwn(identity.build_flags, buildFlag)) {
+      if (!identity?.build_flags) {
-        // Missing key in build_flags means manifest is incomplete; availability unknown
         return { phase: "checking", state: "checking" };
       }
       if (identity.build_flags[buildFlag] !== true) {
