test/test_web/mutations/200-slice1/m2-skip-layer1-validation.patch
--- a/data/shell.js
+++ b/data/shell.js
@@ -52,9 +52,7 @@
   const publishIdentity = (identity) => {
-    const validatedIdentity = validateIdentityShape(identity);
-    window.PAIdentity = validatedIdentity;
+    window.PAIdentity = identity;
     if (typeof window.dispatchEvent === "function") {
-      if (validatedIdentity) {
+      if (identity) {
         window.dispatchEvent(new CustomEvent("pa:identity-available", { detail: validatedIdentity }));
       } else {
         // Invalid manifest shape is treated as unavailable
