test/test_web/mutations/200-slice1/m5-wrong-phase-on-missing-key.patch
--- a/data/setup.js
+++ b/data/setup.js
@@ -38,7 +38,7 @@
       if (!identity?.build_flags || !Object.hasOwn(identity.build_flags, buildFlag)) {
         // Missing key in build_flags means manifest is incomplete; availability unknown
-        return { phase: "checking", state: "checking" };
+        return { phase: "ready", state: "checking" };
       }
       if (identity.build_flags[buildFlag] !== true) {
         return { phase: "ready", state: "not-in-this-build" };
