test/test_web/mutations/200-slice1/m6-remove-null-check.patch
--- a/data/shell.js
+++ b/data/shell.js
@@ -50,7 +50,7 @@ const validateIdentityShape = (identity) => {
     // Identity must be an object
-    if (!identity || typeof identity !== "object" || Array.isArray(identity)) {
+    if (typeof identity !== "object" || Array.isArray(identity)) {
       return null;
     }
     // board must be a string if present
