test/test_web/mutations/241/m3-success-waits-for-controller-reboot.patch
--- a/data/firmware.js
+++ b/data/firmware.js
@@ -446,7 +446,7 @@
     setUploadBusy(true);
     doUpload("/upload/wifi-module", formData, () => {
       if (wmProgressBar) wmProgressBar.style.width = "100%";
-      waitForModuleBack(() => setUploadBusy(false));
+      waitForReconnect(wmFeedback, wmProgressStatus, 'firmware', () => setUploadBusy(false));
     }, (errorMessage) => {
       setUploadBusy(false);
       if (wmProgressStatus) wmProgressStatus.textContent = "Update failed";
