test/test_web/mutations_340/m1_track_count_capability_is_ignored.patch
diff --git i/data/sound.js w/data/sound.js
index 2238dee7..679f7a1e 100644
--- i/data/sound.js
+++ w/data/sound.js
@@ -302,7 +302,7 @@
   const applyCapabilityUI = (caps) => {
     const supportsStatusQuery = (caps & AUDIO_CAP_STATUS_QUERY) !== 0;
     const supportsDeviceType = (caps & AUDIO_CAP_DEVICE_TYPE) !== 0;
-    const supportsTrackCount = (caps & AUDIO_CAP_TRACK_COUNT) !== 0;
+    const supportsTrackCount = true;
     const supportsCurrentTrack = (caps & AUDIO_CAP_CURRENT_TRACK) !== 0;
     const supportsSafePlayingQuery = (caps & AUDIO_CAP_QUERY_SAFE_PLAYING) !== 0;
     const supportsCatalog = (caps & AUDIO_CAP_CATALOG) !== 0;
