test/test_web/mutations_340/m2_total_tracks_row_is_gated_on_the_wrong_bit.patch
diff --git i/data/sound.js w/data/sound.js
index 2238dee7..a30058ff 100644
--- i/data/sound.js
+++ w/data/sound.js
@@ -335,7 +335,7 @@
     applyChirpBindingBadges();
 
     setElementVisible(modDeviceRow, supportsStatusQuery && supportsDeviceType);
-    setElementVisible(modTotalTracksRow, supportsStatusQuery && supportsTrackCount);
+    setElementVisible(modTotalTracksRow, supportsStatusQuery && supportsCurrentTrack);
     setElementVisible(modCurrentTrackRow, supportsStatusQuery && supportsCurrentTrack);
     setElementVisible(modPollSection, showManualPoll);
     setElementVisible(btnPoll, showManualPoll);
