test/test_web/mutations_341/m2_two_families_look_alike.patch
diff --git i/data/style.css w/data/style.css
index dd3a8594..1f95b3c9 100644
--- i/data/style.css
+++ w/data/style.css
@@ -998,10 +998,10 @@ input.input-narrow:focus {
 .availability-finding-out,
 .feature-availability-row.feature-state-checking,
 .feature-availability-row.feature-state-identity-unavailable {
-  border-left-style: dotted;
-  border-left-color: var(--text-dim);
+  border-left-style: dashed;
+  border-left-color: var(--border);
   background-image: none;
-  opacity: var(--avail-dim-finding);
+  opacity: var(--avail-dim-elsewhere);
 }
 
 /* settled no — a roadmap card, or a controller that will never describe
