test/test_web/mutations_343/m1_a_design_change_fences_the_parts.patch
diff --git i/data/droid_build.js w/data/droid_build.js
index f1695e70..e6578607 100644
--- i/data/droid_build.js
+++ w/data/droid_build.js
@@ -164,7 +164,7 @@
     if (Array.isArray(request.fitted)) {
       build.fitted = Array.from(request.fitted);
     }
-    const fitted = new Set(build.fitted);
+    const fitted = new Set();
 
     const changedHalves = [];
     Object.keys(HALVES).forEach((half) => {
