test/test_web/mutations_343/m6_the_card_shows_the_built_in_drawing_to_everyone.patch
diff --git i/data/dome_control.js w/data/dome_control.js
index 8245f9e8..d4aeaa57 100644
--- i/data/dome_control.js
+++ w/data/dome_control.js
@@ -82,9 +82,6 @@
       if (hasLiveElements && window.DomeLayoutRender?.renderPicker) {
         return window.DomeLayoutRender.renderPicker(model);
       }
-      if (model?.usesVendoredDrawing === false) {
-        return '';
-      }
       return window.DOME_PANEL_MAP_SVG || '';
     }
 
