test/test_web/mutations_343/m7_a_part_moves_to_the_other_half.patch
diff --git i/data/droid_parts.js w/data/droid_parts.js
index c64c5c73..1bc416d9 100644
--- i/data/droid_parts.js
+++ w/data/droid_parts.js
@@ -120,7 +120,7 @@
         "id": "pie1",
         "section": "dome_pies",
         "name": "Dome pie 1",
-        "half": "dome",
+        "half": "body",
         "shorthand": "PP1",
         "aliases": [
           "PP1",
