test/test_web/mutations_344/m14_the_wifi_outcome_is_reported_before_it_settles.patch
diff --git i/data/wifi.js w/data/wifi.js
index a2061460..1dd95c45 100644
--- i/data/wifi.js
+++ w/data/wifi.js
@@ -639,7 +639,7 @@
   if (window.PABootstrap) {
     window.addEventListener("pa:bootstrap-change", (event) => {
       gateOnSectionState(event.detail?.sections || []);
-      if (event.detail?.sectionsStable && !loadOutcomeReported) {
+      if (!loadOutcomeReported) {
         loadOutcomeReported = true;
         reportLoadOutcome();
       }
