test/test_web/mutations_344/m6_returning_to_a_surface_fetches_it_again.patch
diff --git i/data/shell.js w/data/shell.js
index d1f77450..88f5d6d3 100644
--- i/data/shell.js
+++ w/data/shell.js
@@ -467,7 +467,7 @@
     const previous = currentSurface ? mounted.get(currentSurface.page) : null;
     if (previous) detach(previous);
 
-    const existing = mounted.get(surface.page);
+    const existing = null;
     if (existing) {
       attach(surface, existing);
       return;
