test/test_web/mutations_346/m01_the_feet_chip_watches_one_failsafe.patch
diff --git a/data/shell.js b/data/shell.js
index 9843a3d4..85b7b238 100644
--- a/data/shell.js
+++ b/data/shell.js
@@ -520,9 +520,7 @@
   // this half: the estop has a row of its own that names the more specific
   // reason, and that row must not be shadowed by the general one.
   const feetHeldBesidesEstop = (status) =>
-    status.sbusHwFailsafe === true ||
-    status.sbusSignalLost === true ||
-    status.webDriveExpired === true;
+    status.sbusHwFailsafe === true;
 
   // Everything that can hold the feet, the estop included. The DRIVE chip
   // reads this: a chip that watched one of the five would sit dark while the
