test/test_web/mutations_346/m04_a_busy_dome_bus_reads_as_a_dead_link.patch
diff --git a/data/shell.js b/data/shell.js
--- a/data/shell.js
+++ b/data/shell.js
@@ -516,9 +516,6 @@
         const linkState = link !== null && typeof link === "object" ? link.state : undefined;
         if (linkState === "connected") return chipState("live", "OK");
         if (linkState === "disabled") return chipState("", "OFF");
-        if (link !== null && typeof link === "object" && link.uart_owner === "audio") {
-          return chipState("", "SOUND HAS BUS");
-        }
         if (linkState === "lost") return chipState("stopped", "LOST");
         if (linkState === "not_seen") return chipState("", "NO HEARTBEAT");
         return chipState("", CHIP_UNKNOWN);
