test/test_web/mutations_346/m05_the_sound_chip_reads_only_link_ok.patch
diff --git a/data/shell.js b/data/shell.js
index 9843a3d4..148fc7b3 100644
--- a/data/shell.js
+++ b/data/shell.js
@@ -674,7 +674,6 @@
         if (!hasKey(status, "audio")) return chipState("", "OFF");
         const audio = status.audio;
         if (audio === null || typeof audio !== "object") return chipState("", CHIP_UNKNOWN);
-        if (audio.rx_status === "blocked_by_dome_uart") return chipState("", "HELD BY DOME");
         if (audio.link_ok === true) return chipState("live", "OK");
         if (audio.rx_status === "no_response") return chipState("stopped", "NO ANSWER");
         return chipState("", CHIP_UNKNOWN);
