test/test_web/mutations_346/m06_the_speed_chip_names_the_preset.patch
diff --git a/data/shell.js b/data/shell.js
--- a/data/shell.js
+++ b/data/shell.js
@@ -499,7 +499,7 @@
       // printed the only delay the app had when its label was written.
       read: (status) => {
         const cap = Number(status.speedLimitMax);
-        return chipState("", Number.isFinite(cap) ? String(cap) : CHIP_UNKNOWN);
+        return chipState("", Number.isFinite(cap) ? String(status.speedPreset) : CHIP_UNKNOWN);
       },
     },
     {
