test/test_web/mutations_346/m07_a_chip_keeps_a_state_class_it_no_longer_wants.patch
diff --git a/data/shell.js b/data/shell.js
--- a/data/shell.js
+++ b/data/shell.js
@@ -868,7 +868,7 @@
       const cell = plateCells.get(chip.id);
       if (!cell) return;
       const painted = status ? chip.read(status) : chipState("", CHIP_UNKNOWN);
-      cell.node.className = painted.state ? `status-chip status-chip-${painted.state}` : "status-chip";
+      if (painted.state) cell.node.classList.add(`status-chip-${painted.state}`);
       if (cell.value) cell.value.textContent = painted.value;
     });
   };
