test/test_web/mutations_346/m08_a_replayed_frame_restamps_the_age.patch
diff --git a/data/shell.js b/data/shell.js
--- a/data/shell.js
+++ b/data/shell.js
@@ -921,10 +921,8 @@
 
   const notePlateStatus = (payload) => {
     if (!payload || typeof payload !== "object") return;
-    if (payload !== plateFrame) {
-      plateFrame = payload;
-      plateFrameAt = Date.now();
-    }
+    plateFrame = payload;
+    plateFrameAt = Date.now();
     // A frame arriving at all is the stream working, whether it is new or the
     // cached one replayed on reconnect.
     plateStreamBroken = false;
