test/test_web/mutations_346/m08_a_replayed_frame_restamps_the_age.patch
diff --git a/data/shell.js b/data/shell.js
index ca9d5200..c718b44d 100644
--- a/data/shell.js
+++ b/data/shell.js
@@ -1125,7 +1125,7 @@
     plateFrame = payload;
     // The transport says when this frame arrived, so a replay keeps the age of
     // the measurement instead of taking the age of the replay.
-    plateFrameAt = typeof meta?.receivedAt === "number" ? meta.receivedAt : Date.now();
+    plateFrameAt = Date.now();
     // Only a frame the droid has just sent is evidence that we are hearing it.
     // A replay is the session's own cache handed back -- it proves the browser
     // still has a copy, which is not the same claim and was the one being made.
