test/test_web/mutations_346/m09_the_plate_blanks_when_the_stream_drops.patch
diff --git a/data/shell.js b/data/shell.js
index ca9d5200..f5cb8f26 100644
--- a/data/shell.js
+++ b/data/shell.js
@@ -909,6 +909,7 @@
   // resync read, and a frame that is not one a reading may be made from.
   const notePlateRefreshFailed = (reason) => {
     plateNotHearing = reason;
+    paintPlate(null);
     renderPlateFreshness();
   };
 
