test/test_web/mutations_346/m09_the_plate_blanks_when_the_stream_drops.patch
diff --git a/data/shell.js b/data/shell.js
--- a/data/shell.js
+++ b/data/shell.js
@@ -1123,6 +1123,7 @@
       if (eventType === "status") notePlateStatus(payload);
       else if (eventType === "stream_error") {
         plateStreamBroken = true;
+        paintPlate(null);
         renderPlateFreshness();
       }
     });
