test/test_web/mutations_346/m12_the_affordance_moves_with_the_state.patch
diff --git a/data/shell.js b/data/shell.js
--- a/data/shell.js
+++ b/data/shell.js
@@ -869,6 +869,7 @@
       if (!cell) return;
       const painted = status ? chip.read(status) : chipState("", CHIP_UNKNOWN);
       cell.node.className = painted.state ? `status-chip status-chip-${painted.state}` : "status-chip";
+      cell.node.setAttribute("title", `${chip.label} ${painted.value}`);
       if (cell.value) cell.value.textContent = painted.value;
     });
   };
