test/test_web/mutations_346/m13_every_press_is_an_attempt.patch
diff --git a/data/shell.js b/data/shell.js
--- a/data/shell.js
+++ b/data/shell.js
@@ -1082,9 +1082,7 @@
     document.addEventListener(
       "pointerdown",
       (event) => {
-        const rising = !noticePressing;
         noticePressing = true;
-        if (!rising) return;
         // aria-disabled rather than the `disabled` property: gateControls()
         // sets both, and the attribute is the one a container can carry for a
         // control that is not a form element.
