test/test_web/mutations_346/m15_the_window_outlives_the_thing_it_was_about.patch
diff --git a/data/shell.js b/data/shell.js
--- a/data/shell.js
+++ b/data/shell.js
@@ -1073,7 +1073,6 @@
   const releaseSettledCauses = (status) => {
     IGNORED_INPUT_CAUSES.forEach((cause) => {
       if (cause.active(status)) return;
-      noticeShownAt.delete(cause.id);
       if (noticeCause === cause.id) hideNotice();
     });
   };
