test/test_web/mutations_346/m16_the_notice_stays_up_after_its_cause_clears.patch
diff --git a/data/shell.js b/data/shell.js
--- a/data/shell.js
+++ b/data/shell.js
@@ -1074,7 +1074,6 @@
     IGNORED_INPUT_CAUSES.forEach((cause) => {
       if (cause.active(status)) return;
       noticeShownAt.delete(cause.id);
-      if (noticeCause === cause.id) hideNotice();
     });
   };
 
