test/test_web/mutations_346/m18_the_notice_fires_for_a_control_that_is_live.patch
diff --git a/data/shell.js b/data/shell.js
--- a/data/shell.js
+++ b/data/shell.js
@@ -1128,8 +1128,7 @@
         // aria-disabled rather than the `disabled` property: gateControls()
         // sets both, and the attribute is the one a container can carry for a
         // control that is not a form element.
-        const refused = refusedAt(event);
-        if (!refused) return;
+        const refused = event.target;
         // Except when it means BUSY rather than off. The Dashboard marks a
         // control aria-disabled while its request is in flight -- the sleep
         // toggle, the Commanded Mode buttons and the Mood buttons all do
