test/test_web/mutations_346/m19_a_control_waiting_for_the_droid_reads_as_one_that_is_off.patch
diff --git a/data/shell.js b/data/shell.js
--- a/data/shell.js
+++ b/data/shell.js
@@ -1138,7 +1138,6 @@
         // switched off" about a control that is merely waiting for the droid
         // to answer is false, and it would fire on exactly the second press an
         // impatient operator makes.
-        if (refused.classList?.contains?.("is-pending")) return;
         reportIgnoredInput();
       },
       true
