test/test_web/mutations_346/m20_a_refused_control_the_browser_hides_is_never_found.patch
diff --git a/data/shell.js b/data/shell.js
--- a/data/shell.js
+++ b/data/shell.js
@@ -1099,8 +1099,7 @@
   const refusedAt = (event) => {
     const target = event.target;
     if (!target?.closest) return null;
-    const hit = target.closest('[aria-disabled="true"]');
-    if (hit) return hit;
+    return target.closest('[aria-disabled="true"]');
     const { clientX, clientY } = event;
     if (typeof clientX !== "number" || typeof clientY !== "number") return null;
     const candidates = target.querySelectorAll?.('[aria-disabled="true"]') || [];
