test/test_web/mutations_346/m21_the_pointer_box_is_never_consulted.patch
diff --git a/data/shell.js b/data/shell.js
--- a/data/shell.js
+++ b/data/shell.js
@@ -1107,13 +1107,7 @@
     return (
       Array.from(candidates).find((candidate) => {
         const box = candidate.getBoundingClientRect?.();
-        return (
-          box &&
-          clientX >= box.left &&
-          clientX <= box.right &&
-          clientY >= box.top &&
-          clientY <= box.bottom
-        );
+        return !!box;
       }) || null
     );
   };
