test/test_web/mutations_346/m28_a_refused_frame_is_not_a_failed_refresh.patch
diff --git a/data/shell.js b/data/shell.js
index ca9d5200..fb99586a 100644
--- a/data/shell.js
+++ b/data/shell.js
@@ -1366,7 +1366,7 @@
       // The controller answered and could not build a status, or sent one this
       // browser could not parse. Either way a refresh was attempted and
       // produced no reading.
-      else if (eventType === "status_error") notePlateRefreshFailed("frame");
+      else if (eventType === "status_error") { /* the refresh produced nothing */ }
       else if (eventType === "stream_error") notePlateRefreshFailed("link");
       else if (eventType === "stream_resync") {
         // The stream came back. What it replays is the frame from before it
