test/test_web/mutations_347/m02_the_body_arms_fall_out_of_their_group.patch
diff --git i/data/parts.js w/data/parts.js
index 8d60da27..450cc3eb 100644
--- i/data/parts.js
+++ w/data/parts.js
@@ -49,7 +49,7 @@
     { id: "dome-lights", label: "Dome lights", sections: ["dome_lights"] },
     { id: "holos", label: "Holoprojectors", sections: ["holoprojectors"] },
     { id: "dome-buttons", label: "Dome buttons", sections: ["dome_fixtures"] },
-    { id: "body", label: "Body doors & arms", sections: ["body_doors", "body_arms"] },
+    { id: "body", label: "Body doors & arms", sections: ["body_doors"] },
     { id: "additions", label: "Common additions", sections: [] },
     { id: "other", label: "Other (not on the model)", sections: ["other_slots"], unit: ["placeholder", "placeholders"] },
     { id: "unsorted", label: "More parts", sections: [] },
