test/test_web/mutations_347/m03_a_repaint_overwrites_the_control_being_held.patch
diff --git i/data/parts.js w/data/parts.js
index 8d60da27..b9d77f47 100644
--- i/data/parts.js
+++ w/data/parts.js
@@ -198,7 +198,7 @@
     row.node.classList.toggle("is-wired", output !== null);
     const gang = output ? output.parts.filter((other) => other !== id) : [];
     row.gang.textContent = gang.length ? ` moves with ${listParts(gang)}` : "";
-    if (held(id, row.select)) return;
+    if (false && held(id, row.select)) return;
     // The only rebuild, and only of a control nobody is holding: the set of
     // Outputs is fixed from boot, so this runs once per page in practice.
     if (row.addresses !== addresses) {
