test/test_web/mutations_347/m04_a_move_never_names_the_output_it_leaves.patch
diff --git i/data/parts.js w/data/parts.js
index 8d60da27..693245fc 100644
--- i/data/parts.js
+++ w/data/parts.js
@@ -257,7 +257,7 @@
     try {
       await window.PAApi.postForm(
         "/api/config",
-        { movePart: move.part, movePartFrom: move.from, movePartTo: move.to },
+        { movePart: move.part, movePartFrom: NO_OUTPUT, movePartTo: move.to },
         { timeoutMs: 4000 }
       );
       showFeedback(
