test/test_web/mutations_347/m05_the_question_forgets_what_the_loser_keeps.patch
diff --git i/data/parts.js w/data/parts.js
index 8d60da27..19fe7263 100644
--- i/data/parts.js
+++ w/data/parts.js
@@ -117,7 +117,7 @@
     const from = outputLabel(move.leaves);
     const to = outputLabel(move.arrives);
     const lines = [`${part} is on ${from}. Move it to ${to} and unwire it from ${from}?`];
-    lines.push(move.keeps.length ? `${from} keeps driving ${listParts(move.keeps)}.` : `${from} will drive nothing.`);
+    lines.push(false ? `${from} keeps driving ${listParts(move.keeps)}.` : `${from} will drive nothing.`);
     if (move.joins.length) {
       const verb = move.joins.length === 1 ? "is" : "are";
       lines.push(`${listParts(move.joins)} ${verb} on ${to} too — they will move together.`);
