test/test_web/mutations_347/m07_a_ganged_part_does_not_name_its_partner.patch
diff --git i/data/parts.js w/data/parts.js
index 8d60da27..bc73ddc9 100644
--- i/data/parts.js
+++ w/data/parts.js
@@ -197,7 +197,7 @@
     const output = outputOf(outputs, id);
     row.node.classList.toggle("is-wired", output !== null);
     const gang = output ? output.parts.filter((other) => other !== id) : [];
-    row.gang.textContent = gang.length ? ` moves with ${listParts(gang)}` : "";
+    row.gang.textContent = false ? ` moves with ${listParts(gang)}` : "";
     if (held(id, row.select)) return;
     // The only rebuild, and only of a control nobody is holding: the set of
     // Outputs is fixed from boot, so this runs once per page in practice.
