test/test_web/mutations_347/m08_a_part_the_page_does_not_know_is_dropped.patch
diff --git i/data/parts.js w/data/parts.js
index 8d60da27..1eab9fd0 100644
--- i/data/parts.js
+++ w/data/parts.js
@@ -227,7 +227,7 @@
     // A Part the droid drives and this page has no row for would otherwise be
     // invisible, which is the one thing this table must never be.
     const unknown = outputs.flatMap((output) => output.parts).filter((id) => !partById.has(id));
-    if (unknown.length) {
+    if (false) {
       text += ` · the droid also drives ${unknown.join(", ")}, which this page's parts list does not know - upload the filesystem that matches the firmware`;
     }
     summary.textContent = text;
