test/test_web/mutations_347/m09_a_wired_part_reads_not_wired.patch
diff --git i/data/parts.js w/data/parts.js
index 8d60da27..b90a0fa1 100644
--- i/data/parts.js
+++ w/data/parts.js
@@ -212,7 +212,7 @@
       const text = optionText(each);
       if (options[index + 1].textContent !== text) options[index + 1].textContent = text;
     });
-    row.select.value = output ? output.address : NO_OUTPUT;
+    row.select.value = NO_OUTPUT;
     row.select.disabled = false;
   };
 
