test/test_web/mutations_350/m01_the_sheet_forgets_what_it_does_not_drive.patch
diff --git i/data/wiring.js w/data/wiring.js
index 64d230db..791d588a 100644
--- i/data/wiring.js
+++ w/data/wiring.js
@@ -169,8 +169,7 @@
   // and it is reading it for the question the field answers: what path a Part
   // CAN be driven through on the design. What drives it on THIS droid is still
   // the Servo Output rows and never this field (#375), which is the join below.
-  const drivableHere = (part) =>
-    part.control !== null && part.control !== undefined && part.control !== "dome-link";
+  const drivableHere = (part) => part !== null;
 
   const outOfScope = (part) => !drivableHere(part);
 
