test/test_web/mutations_350/m02_a_switched_off_output_reads_as_driven.patch
diff --git i/data/wiring.js w/data/wiring.js
index 64d230db..562f2f64 100644
--- i/data/wiring.js
+++ w/data/wiring.js
@@ -242,7 +242,7 @@
             `Put it on an output in ${PARTS_ROUTE}.`,
         };
       }
-      if (!switchedOn(toggles, output.name)) {
+      if (switchedOn(toggles, output.name)) {
         return {
           tier: "component-disabled",
           part,
