test/test_web/mutations_350/m04_the_scope_statement_stays_in_the_header.patch
diff --git i/data/wiring.js w/data/wiring.js
index 64d230db..dcbc1cb7 100644
--- i/data/wiring.js
+++ w/data/wiring.js
@@ -317,8 +317,7 @@
   const BOX_W = 416;
   const TOP = 46;
 
-  const svgScopeLine = (y) =>
-    `<text class="wd-scope" x="${BOARD_X}" y="${y}">${esc(SCOPE)}</text>`;
+  const svgScopeLine = (y) => (y ? "" : "");
 
   const svgOpen = (title, height) =>
     `<svg class="wd" viewBox="0 0 ${DIAGRAM_W} ${height}" role="img" ` +
