test/test_web/mutations_350/m05_the_footnote_lists_every_tier_it_has_ever_had.patch
diff --git i/data/wiring.js w/data/wiring.js
index 64d230db..ceca8bc5 100644
--- i/data/wiring.js
+++ w/data/wiring.js
@@ -734,7 +734,7 @@
               `</section>`
           )
           .join("") + outOfScopeHtml(parts),
-      footnoteHtml: footnoteHtml(present, hasDesignNames),
+      footnoteHtml: footnoteHtml(TIERS, hasDesignNames),
     };
   };
 
