test/test_web/mutations_350/m08_the_cadence_loses_whose_figure_it_is.patch
diff --git i/data/wiring.js w/data/wiring.js
index 64d230db..81854c6f 100644
--- i/data/wiring.js
+++ w/data/wiring.js
@@ -637,9 +637,7 @@
     `expands a move of its own, such as putting every output back to centre, it starts outputs ` +
     `<b>${esc(CADENCE)}</b> apart, and an output that takes longer than that to travel holds ` +
     `the next one off for as long as it is still moving.</p>` +
-    `<p class="hint">That figure was measured on the Dome Controller, where seven ring servos ` +
-    `share the dome supply. Nobody has measured this body's, so the droid stands in the dome's ` +
-    `number until somebody does.</p>` +
+    `<p class="hint">Leave a servo room to travel before the next one starts.</p>` +
     `<div class="note note-info"><b>How you fuse and distribute that supply is your build's, ` +
     `and no picture on this page is a claim about it.</b> Work out the stall current of ` +
     `everything on a rail rather than the idle draw: a servo fighting a linkage pulls several ` +
