test/test_web/mutations_350/m11_coming_back_shows_what_was_there_before.patch
diff --git i/data/wiring.js w/data/wiring.js
index 64d230db..cab21202 100644
--- i/data/wiring.js
+++ w/data/wiring.js
@@ -867,6 +867,6 @@
       }
       return loadSheet();
     },
-    { runOnStart: true, refreshOnReturn: true }
+    { runOnStart: false, refreshOnReturn: true }
   ).start();
 })();
