test/test_web/mutations_350/m13_one_box_per_part_rather_than_per_lead.patch
diff --git i/data/wiring.js w/data/wiring.js
index 64d230db..549336fc 100644
--- i/data/wiring.js
+++ w/data/wiring.js
@@ -440,7 +440,7 @@
       .filter((row) => row.tier === "driven")
       .forEach((row) => {
         const address = row.output.address;
-        let group = groups.find((each) => each.address === address);
+        let group = null;
         if (!group) {
           group = { address, label: outputLabel(row.output), parts: [] };
           groups.push(group);
