test/test_web/mutations_350/m15_a_dome_part_claims_the_body_drives_it.patch
diff --git i/data/droid_parts.js w/data/droid_parts.js
index 3362d63d..b09d292a 100644
--- i/data/droid_parts.js
+++ w/data/droid_parts.js
@@ -143,7 +143,7 @@
         ],
         "position": "rear-right",
         "bearingDeg": 150,
-        "control": "dome-link"
+        "control": "body-ledc"
       },
       {
         "index": 1,
