test/test_web/mutations_351/m01_the_board_counts_as_a_question.patch
diff --git i/data/setup.js w/data/setup.js
index 92f7df44..2796a1e2 100644
--- i/data/setup.js
+++ w/data/setup.js
@@ -2001,7 +2001,7 @@ const BOARD_LABELS = {
   // shows is arithmetic on the array above and none is ever typed: the planning
   // for this run said nine steps in one place and ten in another, and a typed
   // total is exactly how that becomes a line on screen that lies.
-  const isQuestion = (step) => step.key.charAt(0) !== "_";
+  const isQuestion = (step) => true;
   const questionCount = () => STEPS.filter(isQuestion).length;
   // How many questions the run has reached by `index`, counting the step at it.
   const questionsThrough = (index) => STEPS.slice(0, index + 1).filter(isQuestion).length;
