test/test_web/mutations_351/m03_every_question_claims_an_answer_nobody_gave.patch
diff --git i/data/setup.js w/data/setup.js
index 92f7df44..e65cc3fe 100644
--- i/data/setup.js
+++ w/data/setup.js
@@ -2153,7 +2153,7 @@ const BOARD_LABELS = {
         // it has just not been looked at.
         const tick = document.createElement("span");
         tick.className = seen ? "wizard-tick" : "wizard-tick is-unseen";
-        tick.textContent = seen ? "✓" : "○";
+        tick.textContent = "✓";
         label.appendChild(tick);
       }
       const title = document.createElement("span");
