test/test_web/mutations_351/m05_stopping_leaves_the_run_on_screen.patch
diff --git i/data/setup.js w/data/setup.js
index 92f7df44..4afbafb5 100644
--- i/data/setup.js
+++ w/data/setup.js
@@ -2296,7 +2296,6 @@ const BOARD_LABELS = {
     runState = how;
     ending = false;
     setFeedback("");
-    applyLayout("ended");
   };
 
   if (backButton) backButton.addEventListener("click", () => goTo(current - 1));
