test/test_web/mutations_351/m06_stopping_is_recorded_as_having_answered.patch
diff --git i/data/setup.js w/data/setup.js
index 92f7df44..1ddb6b77 100644
--- i/data/setup.js
+++ w/data/setup.js
@@ -2309,7 +2309,7 @@ const BOARD_LABELS = {
       goTo(current + 1);
     });
   }
-  if (stopButton) stopButton.addEventListener("click", () => endRun(RUN_SKIPPED));
+  if (stopButton) stopButton.addEventListener("click", () => endRun(RUN_COMPLETED));
 
   // An answer changed under the builder's hand, so the rail says what they are
   // looking at rather than what it said when the step opened.
