test/test_web/mutations_351/m07_the_run_offers_itself_again_on_the_next_visit.patch
diff --git i/data/setup.js w/data/setup.js
index 92f7df44..93ab8a00 100644
--- i/data/setup.js
+++ w/data/setup.js
@@ -2027,7 +2027,7 @@ const BOARD_LABELS = {
   let saveTimer = null;
   let ending = false;
 
-  const runHasEnded = () => runState !== RUN_NOT_RUN || grandfathered;
+  const runHasEnded = () => grandfathered;
 
   const configuredBeforeTheRecordExisted = (config) => {
     const components = config?.components || {};
