test/test_web/mutations_351/m08_a_droid_set_up_before_the_record_existed_is_walked_through_a_first_run.patch
diff --git i/data/setup.js w/data/setup.js
index 92f7df44..294e4fc9 100644
--- i/data/setup.js
+++ w/data/setup.js
@@ -2378,7 +2378,7 @@ const BOARD_LABELS = {
     const guided = config?.guidedSetup || {};
 
     runState = typeof guided.run === "string" ? guided.run : RUN_NOT_RUN;
-    grandfathered = guided.recorded === false && configuredBeforeTheRecordExisted(config);
+    grandfathered = false;
     (Array.isArray(guided.visited) ? guided.visited : []).forEach((key) => visited.add(String(key)));
 
     renderWifiStep(config);
