test/test_web/mutations_351/m09_the_run_shows_every_card_at_once.patch
diff --git i/data/setup.js w/data/setup.js
index 92f7df44..183a1451 100644
--- i/data/setup.js
+++ w/data/setup.js
@@ -2093,7 +2093,7 @@ const BOARD_LABELS = {
         return;
       }
       if (phase === "running") {
-        show(card, card === currentCard);
+        show(card, true);
         return;
       }
       // The run has ended: the page is its own cards again, minus the ones that
