test/test_web/mutations_351/m11_the_footer_promises_again_that_nothing_is_locked_in.patch
diff --git i/data/setup.js w/data/setup.js
index 92f7df44..a39e2ff6 100644
--- i/data/setup.js
+++ w/data/setup.js
@@ -2200,7 +2200,7 @@ const BOARD_LABELS = {
     // different question for every step and belongs beside the step that owns it
     // (#370); a blanket promise here would be false for at least three of them.
     const total = questionCount();
-    const escape = "you can stop at any step, and stopping ends the run";
+    const escape = "you can stop at any step, and every answer applies straight away";
     if (position) {
       position.textContent = isQuestion(step)
         ? `Question ${questionsThrough(current)} of ${total} · ${escape}.`
