test/test_web/mutations_352/m01_a_repaint_drops_the_selection.patch
diff --git i/data/body_view.js w/data/body_view.js
index 5111539a..7f76e90d 100644
--- i/data/body_view.js
+++ w/data/body_view.js
@@ -428,6 +428,7 @@
       said.textContent = state.said || KIND_SAID[kind];
       svg.setAttribute("data-state-kind", kind);
       const marks = state.marks || {};
+      select(null);
       nodes.forEach((node, markerId) => {
         const mark = marks[markerId] || {};
         let token = mark.mark;
