test/test_web/mutations_352/m03_the_leaf_swings_past_the_recorded_end.patch
diff --git i/data/body_view.js w/data/body_view.js
index 5111539a..cb7c472e 100644
--- i/data/body_view.js
+++ w/data/body_view.js
@@ -450,7 +450,7 @@
         node.cell.classList.toggle("has-position", at !== null);
         if (at !== null) {
           const { x, y } = markerAt(node.marker, FACES.findIndex((face) => face.id === node.marker.face));
-          const swing = Math.min(1, Math.max(0, at)) * GEOMETRY.maxSwingDeg;
+          const swing = at * GEOMETRY.maxSwingDeg;
           node.leaf.setAttribute("transform", `rotate(${swing.toFixed(1)} ${x} ${y})`);
         }
         // The marker's accessible name, and the only place its state reaches a
