test/test_web/mutations_352/m07_a_holoprojector_splits_into_one_marker_per_axis.patch
diff --git i/data/body_view.js w/data/body_view.js
index 5111539a..842175f6 100644
--- i/data/body_view.js
+++ w/data/body_view.js
@@ -224,8 +224,7 @@
   // holoprojector and hp2Pan another; a host with no unit is one device on its
   // own. Section as well as unit, so unit 1 of two different sections is two
   // markers.
-  const markerKeyFor = (host) =>
-    host.unit === undefined || host.unit === null ? host.id : `${host.section}:${host.unit}`;
+  const markerKeyFor = (host) => host.id;
 
   const placementFor = (parts) => {
     const rows = Array.isArray(parts) ? parts.filter((part) => part && part.id) : [];
