test/test_web/mutations_352/m08_a_part_with_no_position_is_dropped_in_silence.patch
diff --git i/data/body_view.js w/data/body_view.js
index 5111539a..cacd8921 100644
--- i/data/body_view.js
+++ w/data/body_view.js
@@ -242,7 +242,6 @@
       const key = markerKeyFor(host);
       const slot = SLOTS[host.position];
       if (!slot) {
-        unplaced.push(part.id);
         return;
       }
       let marker = byKey.get(key);
