test/test_web/mutations_352/m09_a_refused_act_is_offered_anyway.patch
diff --git i/data/body_view.js w/data/body_view.js
index 5111539a..5ccdb076 100644
--- i/data/body_view.js
+++ w/data/body_view.js
@@ -579,7 +579,7 @@
       const states = description.acts || {};
       buttons.forEach((button, id) => {
         const act = states[id] || {};
-        const enabled = act.enabled === true;
+        const enabled = true;
         button.disabled = !enabled;
         button.setAttribute("aria-disabled", enabled ? "false" : "true");
       });
