test/test_web/mutations_352/m11_move_it_is_offered_under_a_latched_estop.patch
diff --git i/data/parts.js w/data/parts.js
index 5e699921..401b7bd1 100644
--- i/data/parts.js
+++ w/data/parts.js
@@ -1646,7 +1646,7 @@
         // Always offered where the Part has a row: giving an Output to a Part
         // that already has one is moving it, which is a thing a builder does.
         wire: { enabled: parts.some((id) => rows.has(id)) },
-        move: { enabled: travelPart !== null && estopLatched === false },
+        move: { enabled: travelPart !== null },
       },
       why,
       parts,
