test/test_web/mutations_352/m12_an_unmeasured_output_is_treated_as_measured.patch
diff --git i/data/parts.js w/data/parts.js
index 5e699921..dd226ff1 100644
--- i/data/parts.js
+++ w/data/parts.js
@@ -1594,7 +1594,7 @@
   // be reached from here at all - the same bound the calibration dial keeps.
   const travelOutputFor = (partId) => {
     const output = outputs === null ? null : outputOf(outputs, partId);
-    if (!output || output.name === "" || isLightRow(output) || !output.calibrated) return null;
+    if (!output || output.name === "" || isLightRow(output)) return null;
     return output;
   };
 
