test/test_web/mutations_352/m14_the_picture_is_not_repainted_from_the_droids_answer.patch
diff --git i/data/parts.js w/data/parts.js
index 5e699921..31498801 100644
--- i/data/parts.js
+++ w/data/parts.js
@@ -495,7 +495,6 @@
     // And the picture at the head of the surface, from the same one answer the
     // two tables were just painted from: a body view that read the droid on its
     // own clock could show a part open while the row below it said closed.
-    paintBody();
   };
 
   const loadOutputs = async ({ handle = null } = {}) => {
