test/test_web/mutations_352/m16_add_it_to_the_build_sends_the_set_unchanged.patch
diff --git i/data/parts.js w/data/parts.js
index 5e699921..1d8a5199 100644
--- i/data/parts.js
+++ w/data/parts.js
@@ -1685,7 +1685,7 @@
       const fitted = fittedNow();
       if (fitted === null || pick.unfitted.length === 0) return;
       const names = pick.unfitted.map(partLabel).join(", ");
-      window.DroidBuild.applyDroidBuild({ fitted: fitted.concat(pick.unfitted) })
+      window.DroidBuild.applyDroidBuild({ fitted: fitted })
         .then((result) => {
           showFeedback(
             result.persisted
