test/test_web/mutations_354/m04_a_repeated_flutter_counts_as_a_repeat.patch
diff --git i/data/seq_rehearsal.js w/data/seq_rehearsal.js
index 76f5d899..bf47d312 100644
--- i/data/seq_rehearsal.js
+++ w/data/seq_rehearsal.js
@@ -173,7 +173,7 @@
         const intent = panelIntent(def.cmd);
         if (!intent) return;
         key = `dome:${intent.target}`;
-        command = intent.word === "OF" ? null : `${intent.word}`;
+        command = `${intent.word}`;
         label = { element: panelName(intent.target), verb: panelVerb[intent.word] };
       } else if (def.type === "body") {
         const shape = def.shape || "open";
