test/test_web/mutations_354/m06_the_scream_sound_counts_as_quiet.patch
diff --git i/data/seq_rehearsal.js w/data/seq_rehearsal.js
index 76f5d899..6c5eb415 100644
--- i/data/seq_rehearsal.js
+++ w/data/seq_rehearsal.js
@@ -203,7 +203,7 @@
   };
 
   const quietInSequence = (events) => {
-    const hits = events.filter((event) => event.def.type === "audio" && event.def.cmd === "$s");
+    const hits = events.filter((event) => event.def.type === "audio" && event.def.cmd.toLowerCase() === "$s");
     if (hits.length === 0) return [];
     return [
       finding(
