test/test_web/mutations_354/m07_a_part_left_open_is_a_warning.patch
diff --git i/data/seq_rehearsal.js w/data/seq_rehearsal.js
index 76f5d899..4956ba69 100644
--- i/data/seq_rehearsal.js
+++ w/data/seq_rehearsal.js
@@ -227,7 +227,7 @@
       .filter(([, last]) => last.shape !== "close")
       .map(([part, last]) =>
         finding(
-          "note",
+          "warning",
           "part-left-open",
           `${part} is still open when the sequence ends, and the body leaves it that way -- nothing closes it for you.`,
           `Add a close for ${part} near the end, unless it is meant to stay open.`,
