test/test_web/mutations_354/m14_the_run_badge_reads_the_unsaved_edits.patch
diff --git i/data/seq.js w/data/seq.js
index 1f5e9811..7459d0eb 100644
--- i/data/seq.js
+++ w/data/seq.js
@@ -2461,7 +2461,7 @@
       await PAApi.postJson("/api/seq/test", { name: seqName });
       // The droid ran what is saved under that name, not the edits on screen,
       // so the badge rehearses the last saved or cloned copy.
-      showRehearsalReport(`${seqName} dispatched.`, "ok", editorState.original, "badge");
+      showRehearsalReport(`${seqName} dispatched.`, "ok", editorState.current, "badge");
     } catch (error) {
       showEditorFeedback("Test failed: " + PAApi.messageFor(error), "error");
     } finally {
