test/test_web/mutations_354/m16_a_failed_read_back_looks_all_clear.patch
diff --git i/data/seq.js w/data/seq.js
index 1f5e9811..f42033ac 100644
--- i/data/seq.js
+++ w/data/seq.js
@@ -2547,7 +2547,7 @@
       const result = await PAApi.get(`/api/seq?name=${encodeURIComponent(seqName)}`);
       badgeEl.innerHTML = window.SeqRehearsal.badgeHtml(window.SeqRehearsal.rehearse(result.data));
     } catch (error) {
-      badgeEl.textContent = `Could not read ${seqName} back to rehearse it: ${PAApi.messageFor(error)}`;
+      badgeEl.textContent = "";
     }
   };
 
