test/test_web/mutations_357/m5_a_light_generates_without_its_kind.patch
diff --git i/data/droid_parts.js w/data/droid_parts.js
index 0a5eedeb..f2d60958 100644
--- i/data/droid_parts.js
+++ w/data/droid_parts.js
@@ -435,7 +435,6 @@
         "position": "right",
         "bearingDeg": 75.5,
         "control": "none",
-        "kind": "light",
         "sitsOn": "panel5"
       },
       {
