test/test_web/mutations_357/m6_a_light_points_at_the_wrong_panel.patch
diff --git i/data/droid_parts.js w/data/droid_parts.js
index 0a5eedeb..7665cd4d 100644
--- i/data/droid_parts.js
+++ w/data/droid_parts.js
@@ -464,7 +464,7 @@
         "bearingDeg": 24,
         "control": "none",
         "kind": "light",
-        "sitsOn": "panel8"
+        "sitsOn": "panel7"
       },
       {
         "index": 25,
