test/test_web/mutations_358/m1_a_part_kind_no_module_reads.patch
diff --git i/data/droid_parts.js w/data/droid_parts.js
index f069e2ec..d1f6e90f 100644
--- i/data/droid_parts.js
+++ w/data/droid_parts.js
@@ -435,7 +435,7 @@
         "position": "right",
         "bearingDeg": 75.5,
         "control": "none",
-        "kind": "light",
+        "kind": "lamp",
         "sitsOn": "panel5"
       },
       {
