test/test_web/mutations_358/m2_a_part_name_on_screen_drifts.patch
diff --git i/data/droid_parts.js w/data/droid_parts.js
index f069e2ec..2a3a1196 100644
--- i/data/droid_parts.js
+++ w/data/droid_parts.js
@@ -624,7 +624,7 @@
         "index": 36,
         "id": "doorFL",
         "section": "body_doors",
-        "name": "Left body door",
+        "name": "Body door",
         "aliases": [
           "Left body door",
           "FL door"
