test/test_web/mutations_359/m11_the_view_is_mounted_over_the_whole_page.patch
diff --git i/data/page_bootstrap.js w/data/page_bootstrap.js
index 3cfd610c..f1cbac63 100644
--- i/data/page_bootstrap.js
+++ w/data/page_bootstrap.js
@@ -913,7 +913,7 @@
   // creates the backdrop, it lands in the same place. A build with no work
   // area has no frame to keep live either, and the body is the honest fallback
   // rather than nowhere to render at all.
-  const recoveryHost = () => document.getElementById("shell-content") || document.body;
+  const recoveryHost = () => document.body;
 
   // The surfaces this view has taken out of the tab order, so they can be put
   // back even after the shell has detached them. The operator can navigate
