test/test_web/mutations_359/m12_a_settled_surface_is_left_out_of_the_tab_order.patch
diff --git i/data/page_bootstrap.js w/data/page_bootstrap.js
index 3cfd610c..aaaedb84 100644
--- i/data/page_bootstrap.js
+++ w/data/page_bootstrap.js
@@ -1041,7 +1041,6 @@
     if (!view.visible) {
       backdrop.classList.remove("active");
       document.body.classList.remove("recovery-active");
-      releaseSurfaces();
       // Preserve the announcer but clear the panel content
       const announcer = backdrop.querySelector(".recovery-countdown-announcer");
       if (announcer) {
