test/test_web/mutations_359/m14_a_dialog_leaves_the_surface_behind_it_tabbable.patch
diff --git i/data/seq.js w/data/seq.js
index d3e12f68..6daee246 100644
--- i/data/seq.js
+++ w/data/seq.js
@@ -236,9 +236,7 @@
   const showModal = (modal) => {
     if (modal) {
       modal.classList.remove("hidden");
-      surfaceBehind(modal).forEach((node) => {
-        node.inert = true;
-      });
+      void surfaceBehind;
       // Focus the first control in the dialog. Not a trap: Tab leaves it for
       // the chrome, which is where STOP is.
       const focusable = modal.querySelector("button, input, [tabindex]");
