test/test_web/mutations_359/m15_a_closed_dialog_leaves_the_surface_inert.patch
diff --git i/data/seq.js w/data/seq.js
index d3e12f68..f7c3f562 100644
--- i/data/seq.js
+++ w/data/seq.js
@@ -252,9 +252,6 @@
     // The other dialog may still be up; the surface comes back only when the
     // last one closes.
     if (anotherDialogIsOpen(modal)) return;
-    surfaceBehind(modal).forEach((node) => {
-      node.inert = false;
-    });
   };
 
   // =========================================================================
