test/test_web/mutations_359/m16_the_shell_publishes_a_different_decision.patch
diff --git i/data/shell.js w/data/shell.js
index b88d24cc..b03e7cf2 100644
--- i/data/shell.js
+++ w/data/shell.js
@@ -523,7 +523,7 @@
   // one. A surface only ever runs inside this shell, so it is always here by
   // the time one asks.
   window.PAEstop = window.PAEstop || {};
-  window.PAEstop.isLatched = estopIsLatched;
+  window.PAEstop.isLatched = (status) => !!status.estop;
 
   // The inputs OTHER than the estop that make DriveTask emit zero frames
   // (src/drive_arbiter.cpp, failsafeIsActive() || webTimedOut). Split out
