test/test_web/mutations_359/m1_a_latched_estop_reads_as_clear.patch
diff --git i/data/shell.js w/data/shell.js
index b88d24cc..114e12e3 100644
--- i/data/shell.js
+++ w/data/shell.js
@@ -1021,7 +1021,7 @@
   // what the droid last said instead, which is a fact rather than a guess.
   const applyEstopStatus = (payload) => {
     if (!hasKey(payload, "estop")) return;
-    estopLatched = estopIsLatched(payload);
+    estopLatched = !estopIsLatched(payload);
     renderEstopState();
   };
 
