test/test_web/mutations_359/m4_the_stop_queues_behind_page_work.patch
diff --git i/data/shell.js w/data/shell.js
index a097fef0..eab8e57e 100644
--- i/data/shell.js
+++ w/data/shell.js
@@ -908,7 +908,7 @@
     if (!window.PAApi) return;
     showEstopFeedback("Stopping the droid...");
     try {
-      await window.PAApi.estopPostForm("/api/estop", {}, { timeoutMs: 3000 });
+      await window.PAApi.postForm("/api/estop", {}, { timeoutMs: 3000 });
     } catch (error) {
       // A stop that did not reach the droid has to say so in its own line:
       // the state line still reports what the droid last told us, which is
