test/test_web/mutations_359/m5_a_fetched_status_is_not_kept.patch
diff --git i/data/status_stream.js w/data/status_stream.js
index 07ee85bd..9186dec9 100644
--- i/data/status_stream.js
+++ w/data/status_stream.js
@@ -67,9 +67,8 @@
       emit("status_error", new Error("The controller could not report its status"));
       return false;
     }
-    lastStatus = payload;
     lastStatusAt = Date.now();
-    emit("status", lastStatus, { cached: false, receivedAt: lastStatusAt });
+    emit("status", payload, { cached: false, receivedAt: lastStatusAt });
     return true;
   };
 
