test/test_web/mutations_359/m6_a_seeded_status_is_not_announced.patch
diff --git i/data/status_stream.js w/data/status_stream.js
index 07ee85bd..de2f16ee 100644
--- i/data/status_stream.js
+++ w/data/status_stream.js
@@ -206,7 +206,7 @@
     // as a replay. A read that came back as an error envelope is refused here
     // exactly as one that arrived on the stream would be.
     seed(status) {
-      adopt(status);
+      if (isStatusFrame(status)) lastStatus = status;
     },
     isSupported() {
       return typeof EventSource !== "undefined";
