test/test_web/mutations_360/m02_a_left_surface_is_never_marked_stale.patch
diff --git i/data/page_bootstrap.js w/data/page_bootstrap.js
index aa6dbd93..10fa30fb 100644
--- i/data/page_bootstrap.js
+++ w/data/page_bootstrap.js
@@ -604,7 +604,7 @@
     surfacePolls.forEach((entry) => {
       const wasRunning = entry.running;
       syncSurfacePoll(entry);
-      if (wasRunning && !entry.running) entry.stale = true;
+      if (wasRunning && !entry.running) entry.stale = false;
     });
   };
 
