test/test_web/mutations_360/m06_the_dashboard_keeps_asking_after_it_is_left.patch
diff --git i/data/app.js w/data/app.js
index 5fadca9e..a690f976 100644
--- i/data/app.js
+++ w/data/app.js
@@ -1327,7 +1327,7 @@
     // Dashboard and starts it again on the way back (ADR 0048, #360). The
     // beforeunload teardown below stays -- it is the other end of the same
     // poll's life, and a closing tab is not a navigation the shell sees.
-    const fallbackPoll = window.PASurface.poll(
+    const fallbackPoll = window.PageBootstrap.createBackgroundPoll(
       refreshFromFallback,
       {
         cadenceMs: 3000,
