test/test_web/mutations_360/m06_the_dashboard_keeps_asking_after_it_is_left.patch
diff --git i/data/app.js w/data/app.js
index 75b59ada..b0dc49b0 100644
--- i/data/app.js
+++ w/data/app.js
@@ -1537,7 +1537,7 @@
     // here: a catch at this site would hand the registry a fulfilled promise
     // for a read that never landed, and the Dashboard would come back saying
     // it was current (#360).
-    const fallbackPoll = window.PASurface.poll(
+    const fallbackPoll = window.PageBootstrap.createBackgroundPoll(
       refreshStatusOnce,
       {
         cadenceMs: 3000,
