test/test_web/mutations_360/m07_dome_keeps_asking_after_it_is_left.patch
diff --git i/data/dome.js w/data/dome.js
index 21188691..be23c988 100644
--- i/data/dome.js
+++ w/data/dome.js
@@ -393,7 +393,7 @@
     // own, rather than three hand-rolled pieces at this site. So is the failed
     // read: PASurface.poll() catches it, which is what keeps a refresh that
     // never landed from reporting the screen as current (#360).
-    window.PASurface.poll(refreshStatus, {
+    window.PageBootstrap.createBackgroundPoll(refreshStatus, {
       cadenceMs: 5000,
       runOnStart: true,
       refreshOnReturn: true,
