test/test_web/mutations_360/m14_sound_keeps_reading_the_module_after_it_is_left.patch
diff --git i/data/sound.js w/data/sound.js
index 7e6fc40f..fac24ad7 100644
--- i/data/sound.js
+++ w/data/sound.js
@@ -316,7 +316,7 @@
   // above the const that defines updateModuleStatus, so naming it here reads
   // it before it exists.
   let moduleStatusCadenceWanted = false;
-  const moduleStatusPoll = window.PASurface.poll(
+  const moduleStatusPoll = window.PageBootstrap.createBackgroundPoll(
     () => updateModuleStatus(),
     { cadenceMs: 2000, skipWhen: () => !moduleStatusCadenceWanted, refreshOnReturn: true }
   );
