test/test_web/mutations_360/m15_a_refresh_that_failed_is_reported_as_an_answer.patch
diff --git i/data/page_bootstrap.js w/data/page_bootstrap.js
index a6198e26..57ea8cab 100644
--- i/data/page_bootstrap.js
+++ w/data/page_bootstrap.js
@@ -587,9 +587,8 @@
           return value;
         },
         (error) => {
-          // Reported, never rethrown, and deliberately NOT marked fresh: what
-          // is on screen is still the reading from before.
           console.warn(`[surface] ${entry.owner || "page"} refresh failed:`, error);
+          markSurfaceFresh(entry);
         },
       );
     }, options);
