test/test_web/mutations_360/m16_a_poll_that_answered_nothing_is_reported_as_fresh.patch
diff --git i/data/page_bootstrap.js w/data/page_bootstrap.js
index a6198e26..c2e73dea 100644
--- i/data/page_bootstrap.js
+++ w/data/page_bootstrap.js
@@ -580,7 +580,10 @@
       const result = attempt();
       // Something that is not a promise never said it asked, so it cannot be
       // read as having been answered: the mark stays up.
-      if (!result || typeof result.then !== "function") return result;
+      if (!result || typeof result.then !== "function") {
+        markSurfaceFresh(entry);
+        return result;
+      }
       return result.then(
         (value) => {
           markSurfaceFresh(entry);
