test/test_web/mutations_360/m17_the_dashboard_swallows_its_failed_read_again.patch
diff --git i/data/app.js w/data/app.js
index 75b59ada..37c53c0e 100644
--- i/data/app.js
+++ w/data/app.js
@@ -1538,7 +1538,7 @@
     // for a read that never landed, and the Dashboard would come back saying
     // it was current (#360).
     const fallbackPoll = window.PASurface.poll(
-      refreshStatusOnce,
+      () => refreshStatusOnce().catch(() => {}),
       {
         cadenceMs: 3000,
         refreshOnReturn: true,
