test/test_web/mutations_360/m18_dome_swallows_its_failed_read_again.patch
diff --git i/data/dome.js w/data/dome.js
index 21188691..7529bbcf 100644
--- i/data/dome.js
+++ w/data/dome.js
@@ -297,8 +297,12 @@
   // here would tell it every read landed (#360).
   const refreshStatus = async () => {
     if (!window.PAApi) return;
-    const result = await window.PAApi.get("/api/status", { timeoutMs: 3000 });
-    renderStatusFrame(result.data);
+    try {
+      const result = await window.PAApi.get("/api/status", { timeoutMs: 3000 });
+      renderStatusFrame(result.data);
+    } catch {
+      // Keep pending/last-known UI state when status is temporarily unavailable.
+    }
   };
 
   const validateRndDomeConfig = () => {
