test/test_web/mutations_360/m19_drive_swallows_its_failed_read_again.patch
diff --git i/data/drive.js w/data/drive.js
index fc545af3..3f31e5a7 100644
--- i/data/drive.js
+++ w/data/drive.js
@@ -517,7 +517,7 @@
     // A failed read is not caught here: PASurface.poll() reports it and leaves
     // the surface showing what it last read, where a catch at this site would
     // report a refresh that never landed as current (#360).
-    window.PASurface.poll(refreshStatusOnce, {
+    window.PASurface.poll(() => refreshStatusOnce().catch(() => {}), {
       cadenceMs: 2000,
       runOnStart: true,
       refreshOnReturn: true,
