test/test_web/mutations_360/m20_rc_diagnostics_swallows_its_failed_read_again.patch
diff --git i/data/rc.js w/data/rc.js
index 6073498c..63fa366e 100644
--- i/data/rc.js
+++ w/data/rc.js
@@ -1707,7 +1707,7 @@
   // hand a rejection to, but it is the registry that has to hear it. Catching
   // it here is what used to tell RC its diagnostics were current when nothing
   // had answered (#360).
-  window.PASurface.poll(loadRcDiagnostics, {
+  window.PASurface.poll(() => loadRcDiagnostics().catch(() => {}), {
     cadenceMs: hasRcStream ? 0 : 1000,
     refreshOnReturn: true,
   }).start();
