test/test_web/mutations_360/m21_servos_swallows_its_failed_read_again.patch
diff --git i/data/servo.js w/data/servo.js
index f8b3c410..bdf90f75 100644
--- i/data/servo.js
+++ w/data/servo.js
@@ -425,7 +425,7 @@
     // and starts it again on the way back (ADR 0048, #360). A failed read is
     // PASurface.poll()'s to report; catching it here would mark the surface
     // current on a refresh that never landed (#360).
-    window.PASurface.poll(refreshStatusOnce, {
+    window.PASurface.poll(() => refreshStatusOnce().catch(() => {}), {
       cadenceMs: 1000,
       runOnStart: true,
       refreshOnReturn: true,
