test/test_web/mutations_360/m24_sound_swallows_its_failed_status_read_again.patch
diff --git i/data/sound.js w/data/sound.js
index 7e6fc40f..f62f823f 100644
--- i/data/sound.js
+++ w/data/sound.js
@@ -2146,7 +2146,7 @@
     // and starts it again on the way back (ADR 0048, #360). A failed read goes
     // to PASurface.poll(), which retries next cycle and keeps the surface
     // showing what it last read rather than reporting it as current (#360).
-    window.PASurface.poll(refreshStatusOnce, {
+    window.PASurface.poll(() => refreshStatusOnce().catch(() => {}), {
       cadenceMs: 2000,
       runOnStart: true,
       refreshOnReturn: true,
