test/test_web/mutations_360/m25_sound_swallows_its_failed_module_read_again.patch
diff --git i/data/sound.js w/data/sound.js
index 7e6fc40f..ee896f86 100644
--- i/data/sound.js
+++ w/data/sound.js
@@ -317,7 +317,7 @@
   // it before it exists.
   let moduleStatusCadenceWanted = false;
   const moduleStatusPoll = window.PASurface.poll(
-    () => updateModuleStatus(),
+    () => updateModuleStatus().catch(() => {}),
     { cadenceMs: 2000, skipWhen: () => !moduleStatusCadenceWanted, refreshOnReturn: true }
   );
   moduleStatusPoll.start();
