test/test_web/mutations_360/m26_wifi_swallows_its_failed_read_again.patch
diff --git i/data/wifi.js w/data/wifi.js
index 034f6120..283da02b 100644
--- i/data/wifi.js
+++ w/data/wifi.js
@@ -575,7 +575,7 @@
   // read: reporting it is PASurface.poll()'s, and catching it here is what used
   // to tell WiFi its diagnostics were current when nothing had answered (#360).
   const diagnosticsPoll = window.PASurface.poll(
-    () => loadWifiDiagnostics(),
+    () => loadWifiDiagnostics().catch(() => {}),
     { cadenceMs: POLL_INTERVAL_MS, refreshOnReturn: true }
   );
 
