test/test_web/mutations_360/m28_a_poll_the_surface_turned_off_still_holds_the_note_up.patch
diff --git i/data/page_bootstrap.js w/data/page_bootstrap.js
index 10754691..43c66057 100644
--- i/data/page_bootstrap.js
+++ w/data/page_bootstrap.js
@@ -555,7 +555,7 @@
   // note up for a surface that is otherwise current.
   const surfaceIsStale = (page) => {
     for (const entry of surfacePolls) {
-      if (entry.owner === page && entry.stale && entry.wanted) return true;
+      if (entry.owner === page && entry.stale) return true;
     }
     return false;
   };
