test/test_web/mutations_361/m01_the_group_marker_never_moves.patch
diff --git i/data/shell.js w/data/shell.js
index 13cdc1a9..a85c1657 100644
--- i/data/shell.js
+++ w/data/shell.js
@@ -664,7 +664,7 @@
     // is an attribute flip on chrome that is already there -- the nav is never
     // re-rendered, or the estop bound inside it would go with it.
     document.querySelectorAll("[data-nav-group]").forEach((groupEl) => {
-      groupEl.classList.toggle("is-current", pagesInGroup.get(groupEl.dataset.navGroup)?.has(page) === true);
+      groupEl.classList.toggle("is-current", false);
     });
   };
 
