test/test_web/mutations_361/m03_sound_is_offered_in_one_group_only.patch
diff --git i/data/shell.js w/data/shell.js
index 13cdc1a9..f5528054 100644
--- i/data/shell.js
+++ w/data/shell.js
@@ -77,7 +77,7 @@
       id: "perform",
       label: "Perform",
       hint: "author a move and play it back",
-      members: ["seq", "sound", "dome"],
+      members: ["seq", "dome"],
     },
     {
       id: "configure",
