test/test_web/mutations_361/m04_a_group_never_says_what_you_would_be_doing.patch
diff --git i/data/shell.js w/data/shell.js
index 13cdc1a9..2395f0a5 100644
--- i/data/shell.js
+++ w/data/shell.js
@@ -375,7 +375,7 @@
         <div class="nav-group" data-nav-group="${group.id}" role="group" aria-labelledby="${labelId}">
           <p class="nav-group-head" id="${labelId}">
             <span class="nav-group-label">${group.label}</span>
-            <span class="nav-group-hint">${group.hint}</span>
+            <span class="nav-group-hint"></span>
           </p>
           <div class="nav-group-links">${links}</div>
         </div>`;
