test/test_web/mutations_361/m08_the_estop_points_at_a_name_the_nav_does_not_use.patch
diff --git i/data/shell.js w/data/shell.js
index 13cdc1a9..fb742fd2 100644
--- i/data/shell.js
+++ w/data/shell.js
@@ -412,7 +412,7 @@
             <button id="shell-estop-button" class="btn danger shell-estop-button" type="button"
                     aria-label="STOP - cut drive now. Clear it on Foot Drive or Dashboard.">
               <span class="shell-estop-action">🛑 STOP</span>
-              <span class="shell-estop-consequence">Cuts drive - clear it on Foot Drive or Dashboard</span>
+              <span class="shell-estop-consequence">Cuts drive - clear it on Drive or Dashboard</span>
             </button>
             <div class="shell-estop-state" id="shell-estop-state" role="status" aria-live="polite">${ESTOP_STATE_TEXT.unknown}</div>
             <div class="shell-estop-feedback feedback compact-feedback" id="shell-estop-feedback" role="status" aria-live="polite" aria-atomic="true"></div>
