test/test_web/mutations_361/m10_a_surface_in_no_group_still_marks_one.patch
diff --git i/data/shell.js w/data/shell.js
index 13cdc1a9..a6212e8c 100644
--- i/data/shell.js
+++ w/data/shell.js
@@ -664,7 +664,9 @@
     // is an attribute flip on chrome that is already there -- the nav is never
     // re-rendered, or the estop bound inside it would go with it.
     document.querySelectorAll("[data-nav-group]").forEach((groupEl) => {
-      groupEl.classList.toggle("is-current", pagesInGroup.get(groupEl.dataset.navGroup)?.has(page) === true);
+      const holders = ACTIVITY_GROUPS.filter((group) => group.members.includes(page));
+      const marked = holders.length ? holders : [ACTIVITY_GROUPS[0]];
+      groupEl.classList.toggle("is-current", marked.some((group) => group.id === groupEl.dataset.navGroup));
     });
   };
 
