test/test_web/mutations_362/m01_the_tick_draws_where_the_output_is_not_where_it_is_going.patch
diff --git i/data/parts.js w/data/parts.js
index 6ec4589c..6b8a4d3e 100644
--- i/data/parts.js
+++ w/data/parts.js
@@ -320,7 +320,7 @@
     row.bar.classList.toggle("is-off", !pulsing);
     row.parts.textContent = output.parts.length ? listParts(output.parts) : NOT_WIRED;
     row.now.style.width = pulsing ? markAt(output.commandedUs, output) : "0%";
-    row.tick.style.left = pulsing ? markAt(output.targetUs, output) : "0%";
+    row.tick.style.left = pulsing ? markAt(output.commandedUs, output) : "0%";
     if (!output.reported) {
       row.us.textContent = "Not reported by this firmware";
       row.release.textContent = "Not reported by this firmware";
