test/test_web/mutations_362/m02_a_ganged_output_names_only_its_first_part.patch
diff --git i/data/parts.js w/data/parts.js
index 6ec4589c..c4edd1c6 100644
--- i/data/parts.js
+++ w/data/parts.js
@@ -318,7 +318,7 @@
     row.node.classList.toggle("is-wired", output.parts.length > 0);
     row.node.classList.toggle("partkind-light", light);
     row.bar.classList.toggle("is-off", !pulsing);
-    row.parts.textContent = output.parts.length ? listParts(output.parts) : NOT_WIRED;
+    row.parts.textContent = output.parts.length ? listParts(output.parts.slice(0, 1)) : NOT_WIRED;
     row.now.style.width = pulsing ? markAt(output.commandedUs, output) : "0%";
     row.tick.style.left = pulsing ? markAt(output.targetUs, output) : "0%";
     if (!output.reported) {
