test/test_web/mutations_362/m03_an_output_with_no_pulse_reads_blank.patch
diff --git i/data/parts.js w/data/parts.js
index 6ec4589c..3782501d 100644
--- i/data/parts.js
+++ w/data/parts.js
@@ -328,7 +328,7 @@
     }
     // An Output with no pulse says so: a blank cell cannot be told from a table
     // that has stopped updating.
-    if (!pulsing) row.us.textContent = "— off";
+    if (!pulsing) row.us.textContent = "";
     else if (light) row.us.textContent = "A light has no position";
     else if (output.targetUs === output.commandedUs) row.us.textContent = `${output.commandedUs} µs`;
     else row.us.textContent = `${output.commandedUs} → ${output.targetUs} µs`;
