test/test_web/mutations_362/m04_a_steal_from_the_output_table_is_sent_without_asking.patch
diff --git i/data/parts.js w/data/parts.js
index 6ec4589c..f6b4897c 100644
--- i/data/parts.js
+++ w/data/parts.js
@@ -515,7 +515,7 @@
     // A pick is a request, not a state this control keeps: it goes back to its
     // prompt, and the row's Drives cell says what the droid answered.
     select.value = "";
-    request(moveFor(outputs, id, address), select);
+    send(moveFor(outputs, id, address));
   });
 
   // A control that was held catches up with whatever arrived while it was.
