test/test_web/mutations_362/m05_an_output_with_no_part_is_counted_as_driving.patch
diff --git i/data/parts.js w/data/parts.js
index 6ec4589c..8ffb5c1b 100644
--- i/data/parts.js
+++ w/data/parts.js
@@ -63,7 +63,7 @@
   // A firmware older than this page reports no position at all, and that is not
   // the same as an Output with no pulse, so it is never counted as switched off.
   const tierOf = (output) => {
-    if (output.parts.length === 0) return "no-part";
+    if (output.parts.length === 0) return "driving";
     return output.reported && output.commandedUs === null ? "switched-off" : "driving";
   };
 
