test/test_web/mutations_362/m06_every_frame_rebuilds_the_output_table.patch
diff --git i/data/parts.js w/data/parts.js
index 6ec4589c..fa3ce885 100644
--- i/data/parts.js
+++ w/data/parts.js
@@ -337,7 +337,7 @@
   };
 
   const paintOutputs = (addresses) => {
-    if (outputAddresses !== addresses) buildOutputs(addresses);
+    buildOutputs(addresses);
     outputs.forEach(paintOutputRow);
     const counts = new Map(TIERS.map((tier) => [tier.id, 0]));
     outputs.forEach((output) => counts.set(tierOf(output), counts.get(tierOf(output)) + 1));
