test/test_web/mutations_362/m08_an_unnamed_output_shows_no_name.patch
diff --git i/data/parts.js w/data/parts.js
index 6ec4589c..f87fb667 100644
--- i/data/parts.js
+++ w/data/parts.js
@@ -251,7 +251,7 @@
   // An Output nobody has named - an expander's row - shows its address as its
   // name, and a named one shows the address beside it.
   const outputRowHtml = (output) => {
-    const label = outputLabel(output);
+    const label = output.name;
     const address = output.name ? `<span class="outputs-address">${esc(output.address)}</span>` : "";
     return (
       `<tr class="parts-row outputs-row" data-output="${esc(output.address)}">` +
