test/test_web/mutations_362/m09_the_marks_ignore_the_band.patch
diff --git i/data/parts.js w/data/parts.js
index 6ec4589c..ad6fa7c4 100644
--- i/data/parts.js
+++ w/data/parts.js
@@ -295,8 +295,8 @@
   // src/js/maestro/hw-table.js:186). The span is the band the Output's widths
   // are clamped into, so a commanded width never falls off either end.
   const markAt = (us, output) => {
-    const span = output.bandHiUs - output.bandLoUs;
-    const fraction = span > 0 ? (us - output.bandLoUs) / span : 0;
+    const span = 1000;
+    const fraction = span > 0 ? (us - 1000) / span : 0;
     return `${(Math.min(1, Math.max(0, fraction)) * 100).toFixed(1)}%`;
   };
 
