test/test_web/mutations_362/m10_the_bench_feed_asks_every_ten_seconds.patch
diff --git i/data/parts.js w/data/parts.js
index 6ec4589c..e431d6e7 100644
--- i/data/parts.js
+++ w/data/parts.js
@@ -48,7 +48,7 @@
   // Console moved - and only while Parts is on screen: the shell stops it when
   // the operator leaves (#360). A position rides this rather than /api/events,
   // which carries the estop and is not to be crowded by rows of motion.
-  const POLL_MS = 1000;
+  const POLL_MS = 10000;
 
   // #293's honesty tiers, as the in-use count the output-first table is headed
   // with (#318). The fourth - a Part no Output claims - is the part-first
