test/test_web/mutations_362/m12_a_firmware_with_no_positions_reads_as_switched_off.patch
diff --git i/data/parts.js w/data/parts.js
index 6ec4589c..68043a61 100644
--- i/data/parts.js
+++ w/data/parts.js
@@ -64,7 +64,7 @@
   // the same as an Output with no pulse, so it is never counted as switched off.
   const tierOf = (output) => {
     if (output.parts.length === 0) return "no-part";
-    return output.reported && output.commandedUs === null ? "switched-off" : "driving";
+    return output.commandedUs === null ? "switched-off" : "driving";
   };
 
   // In the order a builder walks the droid: the dome top down, then the body.
