test/test_web/mutations_362/m13_a_part_loses_its_plain_english_name.patch
diff --git i/data/droid_parts.js w/data/droid_parts.js
index 99d66cc0..2ceec42e 100644
--- i/data/droid_parts.js
+++ w/data/droid_parts.js
@@ -683,7 +683,7 @@
         "index": 37,
         "id": "doorFR",
         "section": "body_doors",
-        "name": "Right body door",
+        "name": "Right door",
         "half": "body",
         "aliases": [
           "Right body door",
