test/test_web/mutations_363/m01_the_next_nudge_is_sent_before_the_previous_has_ended.patch
diff --git i/data/parts.js w/data/parts.js
index f906a668..7024f9f3 100644
--- i/data/parts.js
+++ w/data/parts.js
@@ -673,7 +673,6 @@
       endRun(`${run.address} is not in the droid's answer any more, so the run stopped. ${label} stays ${NOT_WIRED}.`, "warning");
       return;
     }
-    if (output.nudgesDone === run.before) return;
     nudgeNext();
   };
 
