test/test_web/mutations_363/m03_stop_asks_for_the_next_nudge.patch
diff --git i/data/parts.js w/data/parts.js
index f906a668..771c6ce0 100644
--- i/data/parts.js
+++ w/data/parts.js
@@ -722,7 +722,7 @@
 
   const stopRun = () => {
     if (run === null) return;
-    endRun(`Stopped. ${partLabel(run.partId)} stays ${NOT_WIRED}.`);
+    nudgeNext();
   };
 
   runPanel.querySelector(".parts-find-that").addEventListener("click", pickThatOne);
