test/test_web/mutations_363/m04_an_estop_does_not_end_the_run.patch
diff --git i/data/parts.js w/data/parts.js
index f906a668..0e48ba5d 100644
--- i/data/parts.js
+++ w/data/parts.js
@@ -742,7 +742,7 @@
     if (eventType !== "status" || !payload || typeof payload !== "object") return;
     estopLatched = payload.estop === true;
     gateFind();
-    if (estopLatched && run !== null) {
+    if (estopLatched === "never" && run !== null) {
       const { partId, address } = run;
       if (address !== null) markNotCurrent(address);
       endRun(`The estop stopped the run. ${partLabel(partId)} stays ${NOT_WIRED}.`, "error");
