test/test_web/mutations_363/m05_the_estop_does_not_refuse_the_button.patch
diff --git i/data/parts.js w/data/parts.js
index f906a668..dfa648f8 100644
--- i/data/parts.js
+++ w/data/parts.js
@@ -595,7 +595,7 @@
   const spareOutputs = () =>
     outputs.filter((output) => output.parts.length === 0 && output.commandedUs !== null && output.name !== "");
 
-  const gateFind = () => window.PAApi.gateControls(findButtons(), estopLatched === false);
+  const gateFind = () => window.PAApi.gateControls(findButtons(), estopLatched !== null);
 
   const endRun = (text, level) => {
     if (run === null) return;
