test/test_web/mutations_363/m07_an_output_with_no_pulse_is_nudged.patch
diff --git i/data/parts.js w/data/parts.js
index f906a668..d48a088d 100644
--- i/data/parts.js
+++ w/data/parts.js
@@ -593,7 +593,7 @@
   // Output with none cannot twitch, and the firmware would refuse it), and a
   // name the servo route takes as its arm.
   const spareOutputs = () =>
-    outputs.filter((output) => output.parts.length === 0 && output.commandedUs !== null && output.name !== "");
+    outputs.filter((output) => output.parts.length === 0 && output.name !== "");
 
   const gateFind = () => window.PAApi.gateControls(findButtons(), estopLatched === false);
 
