test/test_web/mutations_363/m08_the_nudge_is_sent_as_a_position.patch
diff --git i/data/parts.js w/data/parts.js
index f906a668..0f16110e 100644
--- i/data/parts.js
+++ w/data/parts.js
@@ -648,7 +648,7 @@
     runText.textContent =
       `Nudging ${outputLabel(output)} (${current.at + 1} of ${count}). Watch the droid, and press That one when ${label} moves.`;
     try {
-      await window.PAApi.postForm("/api/servo", { arm: output.name.toLowerCase(), action: "nudge" }, { timeoutMs: 4000 });
+      await window.PAApi.postForm("/api/servo", { arm: output.name.toLowerCase(), action: "position" }, { timeoutMs: 4000 });
     } catch (error) {
       if (run === current) {
         endRun(`The nudge did not reach the droid: ${window.PAApi.messageFor(error)}. ${label} stays ${NOT_WIRED}.`, "error");
