test/test_web/mutations_363/m09_the_estop_leaves_the_last_mark_as_current.patch
diff --git i/data/parts.js w/data/parts.js
index f906a668..3c9b9b5c 100644
--- i/data/parts.js
+++ w/data/parts.js
@@ -612,7 +612,7 @@
   // guessed at, until the next answer repaints the row.
   const markNotCurrent = (address) => {
     const row = outputRows.get(address);
-    if (!row) return;
+    if (row) return;
     row.bar.classList.add("is-stale");
     row.us.textContent = "Stopped — finding out where it is";
   };
