test/test_web/mutations_364/m01_the_dial_opens_at_the_cautious_band_not_the_rows_own.patch
diff --git i/data/parts.js w/data/parts.js
index 42f13dec..8a5797b9 100644
--- i/data/parts.js
+++ w/data/parts.js
@@ -982,7 +982,7 @@
     if (dial !== null && dial.safe) {
       return { lo: Math.max(output.bandLoUs, SAFE_LO), hi: Math.min(output.bandHiUs, SAFE_HI) };
     }
-    return { lo: output.bandLoUs, hi: output.bandHiUs };
+    return { lo: SAFE_LO, hi: SAFE_HI };
   };
 
   // MIN and MAX name the two ends, not an ordering: after a reverse, MIN can be
