test/test_web/mutations_364/m02_the_first_hold_moves_the_part_to_the_middle_of_the_band.patch
diff --git i/data/parts.js w/data/parts.js
index 42f13dec..6ce1b296 100644
--- i/data/parts.js
+++ w/data/parts.js
@@ -1061,7 +1061,7 @@
       // Start from where the droid says the Output is standing, so the first
       // hold does not move the part at all. An Output with no pulse has no
       // position to start from, so the middle of its band is the honest guess.
-      us: output.commandedUs === null ? Math.round((band.lo + band.hi) / 2) : output.commandedUs,
+      us: Math.round((band.lo + band.hi) / 2),
       safe: false,
       ends: false,
       sweeping: false,
