test/test_web/mutations_364/m04_the_capture_sends_a_width_the_dial_is_not_standing_at.patch
diff --git i/data/parts.js w/data/parts.js
index 42f13dec..b1daaea3 100644
--- i/data/parts.js
+++ w/data/parts.js
@@ -1085,7 +1085,7 @@
     try {
       await window.PAApi.postForm(
         "/api/config",
-        { captureOutput: output.address, captureEnd: end, captureUs: String(dial.us) },
+        { captureOutput: output.address, captureEnd: end, captureUs: String(output.centreUs) },
         { timeoutMs: 4000 }
       );
     } catch (error) {
