test/test_web/mutations_364/m06_reverse_sends_the_widths_back_instead_of_the_address.patch
diff --git i/data/parts.js w/data/parts.js
index 42f13dec..a1504c3f 100644
--- i/data/parts.js
+++ w/data/parts.js
@@ -1108,7 +1108,7 @@
     const output = dialOutput();
     if (!output) return;
     try {
-      await window.PAApi.postForm("/api/config", { reverseOutput: output.address }, { timeoutMs: 4000 });
+      await window.PAApi.postForm("/api/config", { reverseOutput: output.address, openUs: String(output.closeUs), closeUs: String(output.openUs) }, { timeoutMs: 4000 });
     } catch (error) {
       setNote(`The ends were not swapped: ${window.PAApi.messageFor(error)}`, "error");
       return;
