test/test_web/mutations_364/m08_closing_the_dial_leaves_the_output_driven.patch
diff --git i/data/parts.js w/data/parts.js
index 42f13dec..3ae1e523 100644
--- i/data/parts.js
+++ w/data/parts.js
@@ -1039,7 +1039,7 @@
     // Closing the dial ends the hold, which is what ADR 0064 says ends it
     // besides the builder pressing pulses off. Leaving it to the expiry would
     // drive the part for three more seconds with nobody watching.
-    if (release) sendServo("release");
+    if (!release) sendServo("release");
     dial = null;
     stopKeepalive();
     dialPanel.hidden = true;
