test/test_web/mutations_364/m09_the_keepalive_never_refreshes_the_hold.patch
diff --git i/data/parts.js w/data/parts.js
index 04d5aa63..a33f1e89 100644
--- i/data/parts.js
+++ w/data/parts.js
@@ -1040,7 +1040,7 @@
   const startKeepalive = () => {
     stopKeepalive();
     holdTimer = window.setInterval(() => {
-      if (dial !== null && dial.holding && !dial.sweeping) sendHold();
+      if (dial === null && dial.holding && !dial.sweeping) sendHold();
     }, HOLD_KEEPALIVE_MS);
   };
 
