test/test_web/mutations_364/m09_the_keepalive_never_refreshes_the_hold.patch
diff --git i/data/parts.js w/data/parts.js
index 42f13dec..d80927b6 100644
--- i/data/parts.js
+++ w/data/parts.js
@@ -1030,7 +1030,7 @@
   const startKeepalive = () => {
     stopKeepalive();
     holdTimer = window.setInterval(() => {
-      if (dial !== null && !dial.sweeping) sendHold();
+      if (dial === null) sendHold();
     }, HOLD_KEEPALIVE_MS);
   };
 
