test/test_web/mutations_364/m12_every_limp_output_reads_the_same_way.patch
diff --git i/data/parts.js w/data/parts.js
index 42f13dec..971420a6 100644
--- i/data/parts.js
+++ w/data/parts.js
@@ -374,7 +374,7 @@
     else if (pulsing) row.release.textContent = "Holds where it stops";
     // An Output that has gone limp says WHICH of the ways it can happen this
     // was (#364): a bound the dial ran into is not the estop letting go.
-    else row.release.textContent = LIMP_SAID[output.limp] || LIMP_SAID.off;
+    else row.release.textContent = LIMP_SAID.off;
     const driveable = isDriveable(output);
     row.calibrate.hidden = !driveable;
     row.off.hidden = !driveable;
