test/test_web/mutations_364/m14_the_estop_does_not_refuse_the_acts.patch
diff --git i/data/parts.js w/data/parts.js
index 42f13dec..561a2ca1 100644
--- i/data/parts.js
+++ w/data/parts.js
@@ -1202,7 +1202,7 @@
   // output-first table is rebuilt whenever the SET of Outputs changes, so its
   // buttons have to be re-gated after each build as well as on each frame.
   const gateActs = () => {
-    const live = estopLatched === false;
+    const live = estopLatched !== null;
     window.PAApi.gateControls(Array.from(outputRows.values(), (row) => row.calibrate), live);
     window.PAApi.gateControls(Array.from(outputRows.values(), (row) => row.off), live);
     window.PAApi.gateControls(Array.from(dialPanel.querySelectorAll("button")), live);
