test/test_web/mutations_364/m19_the_keepalive_takes_the_output_back_after_a_bound_let_go.patch
diff --git i/data/parts.js w/data/parts.js
index 04d5aa63..5e210a8f 100644
--- i/data/parts.js
+++ w/data/parts.js
@@ -1040,7 +1040,7 @@
   const startKeepalive = () => {
     stopKeepalive();
     holdTimer = window.setInterval(() => {
-      if (dial !== null && dial.holding && !dial.sweeping) sendHold();
+      if (dial !== null && !dial.sweeping) sendHold();
     }, HOLD_KEEPALIVE_MS);
   };
 
