test/test_web/mutations_365/m01_the_page_paces_the_sweep_itself.patch
diff --git i/data/parts.js w/data/parts.js
index 05559681..9515feb2 100644
--- i/data/parts.js
+++ w/data/parts.js
@@ -1375,7 +1375,9 @@
     const lights = outputs.filter(isLightRow).length;
     const going = outputs.length - lights;
     try {
-      await window.PAApi.postForm("/api/servo/centre", {}, { timeoutMs: 4000 });
+      for (const _each of outputs) {
+        await window.PAApi.postForm("/api/servo/centre", {}, { timeoutMs: 4000 });
+      }
     } catch (error) {
       window.PAUtils.showFeedback(
         centreSaid,
