test/test_web/mutations_365/m03_the_estop_does_not_refuse_back_to_centre.patch
diff --git i/data/parts.js w/data/parts.js
index 05559681..13b30b42 100644
--- i/data/parts.js
+++ w/data/parts.js
@@ -1251,7 +1251,7 @@
     // Back to centre is an act on every Output at once, so it is refused for
     // the same one fact as the acts on a single row. The controller refuses it
     // too; this is so nothing is offered that the droid will not take.
-    window.PAApi.gateControls([centreButton], live);
+    window.PAApi.gateControls([centreButton], true);
     window.PAApi.gateControls(Array.from(dialPanel.querySelectorAll("button")), live);
     window.PAApi.gateControls([dialSlider], live);
   };
