test/test_web/mutations_365/m04_the_estop_leaves_every_mark_reading_as_current.patch
diff --git i/data/parts.js w/data/parts.js
index 05559681..97fcf2ff 100644
--- i/data/parts.js
+++ w/data/parts.js
@@ -1275,7 +1275,7 @@
     // stops its own packet clock the moment a clamp fires so the HUD cannot go
     // on reading live).
     if (payload.estop === true && outputs !== null) {
-      outputs.forEach((output) => markNotCurrent(output.address));
+      outputs.forEach((output) => output.address);
       window.PAUtils.showFeedback(
         centreSaid,
         "The estop let go of every output. Nothing is being driven, so nothing is going back to centre.",
