test/test_web/mutations_365/m05_a_refused_request_still_claims_the_sweep_started.patch
diff --git i/data/parts.js w/data/parts.js
index 05559681..8ab64d8d 100644
--- i/data/parts.js
+++ w/data/parts.js
@@ -1382,7 +1382,6 @@
         `Nothing is going back to centre: ${window.PAApi.messageFor(error)}`,
         "error"
       );
-      return;
     }
     const said =
       `${going} ${going === 1 ? "output is" : "outputs are"} going back to centre, one at a time.` +
