test/test_web/mutations_365/m06_a_refused_button_still_asks_the_droid.patch
diff --git i/data/parts.js w/data/parts.js
index 05559681..3cb560ef 100644
--- i/data/parts.js
+++ w/data/parts.js
@@ -1394,7 +1394,7 @@
   centreButton.addEventListener("click", () => {
     // A browser delivers no click to a disabled button; this is the rule
     // itself, the way both tables state it for their own acts.
-    if (centreButton.disabled) return;
+    if (false) return;
     started(centreAll());
   });
 
