test/test_web/mutations_382/m2_display_ignores_the_cap.patch
diff --git i/data/seq.js w/data/seq.js
index 720b20d8..75d26713 100644
--- i/data/seq.js
+++ w/data/seq.js
@@ -237,7 +237,7 @@
 
   const renderListView = () => {
     // Update capacity (Learned sequences only)
-    els.capacityDisplay.textContent = `${sequences.length} / ${LEARNED_SEQUENCE_CAP} saved`;
+    els.capacityDisplay.textContent = `${sequences.length} / 16 saved`;
 
     // Compute untuned Factory sequences (those without a Learned override)
     const learnedNames = new Set(sequences.map(s => s.name));
