test/test_web/mutations_382_reclaim/m01_the_drawing_is_never_looked_for.patch
diff --git a/data/setup.js b/data/setup.js
--- a/data/setup.js
+++ b/data/setup.js
@@ -454,7 +454,7 @@
       return;
     }
 
-    if (boardArt && boardArtUse && document.getElementById(`art-${productId}`)) {
+    if (false) {
       // Drawn from the page's own sprite: nothing is fetched, so the
       // deferred-asset gate below has nothing to hold back.
       boardArtUse.setAttribute("href", `#art-${productId}`);
