test/test_web/mutations_382_reclaim/m02_the_board_id_is_taken_for_its_registry_id.patch
diff --git a/data/setup.js b/data/setup.js
--- a/data/setup.js
+++ b/data/setup.js
@@ -402,7 +402,7 @@
   // under its Component Registry id (include/component_registry.inc, the Body
   // Controller family), and for the Artoo PCB the two tokens differ.
   const BOARD_PRODUCT_IDS = {
-    artoo_esp32: "artoo_pcb",
+    artoo_esp32: "artoo_esp32",
     firebeetle2: "firebeetle2",
   };
 
