test/test_web/mutations_382_reclaim/m03_the_photograph_skips_the_deferred_asset_gate.patch
diff --git a/data/setup.js b/data/setup.js
--- a/data/setup.js
+++ b/data/setup.js
@@ -484,8 +484,7 @@
     // Identity can resolve after the one-shot deferred-asset sweep has already run
     // (a section that is visibly waiting to retry already counts as settled), so a
     // late data-deferred-src would never be swept.
-    if (window.PAAssetsReady) boardImage.src = imageSrc;
-    else boardImage.dataset.deferredSrc = imageSrc;
+    boardImage.src = imageSrc;
   };
 
   // Listen for identity available event and update board image
