test/test_web/mutations_382_reclaim/m04_a_drawn_board_still_queues_its_photograph.patch
diff --git a/data/setup.js b/data/setup.js
--- a/data/setup.js
+++ b/data/setup.js
@@ -459,6 +459,7 @@
       // deferred-asset gate below has nothing to hold back.
       boardArtUse.setAttribute("href", `#art-${productId}`);
       boardArt.setAttribute("aria-label", `${boardLabel} PCB`);
+      boardImage.dataset.deferredSrc = `/${productId}.webp`;
       showBoardArt();
       return;
     }
