test/test_web/mutations_382_reclaim/m05_an_unknown_board_asks_for_a_photograph.patch
diff --git a/data/setup.js b/data/setup.js
--- a/data/setup.js
+++ b/data/setup.js
@@ -446,7 +446,7 @@
 
     const boardId = identity.board;
     const boardLabel = BOARD_LABELS[boardId] || boardId;
-    const productId = BOARD_PRODUCT_IDS[boardId];
+    const productId = BOARD_PRODUCT_IDS[boardId] || boardId;
     if (!productId) {
       // Not a registry product, so no set has a drawing or a photograph of it,
       // and there is no /<id>.webp route to ask.
