test/test_web/mutations_382_reclaim/m06_a_failed_photograph_never_gives_way.patch
diff --git a/data/setup.js b/data/setup.js
--- a/data/setup.js
+++ b/data/setup.js
@@ -472,7 +472,6 @@
 
     boardImage.onerror = () => {
       // Board has no photo yet; show placeholder with board name
-      showBoardPlaceholder(`${boardLabel} — No photo of this board yet.`);
     };
 
     // Set alt and title before setting src
