test/test_web/mutations_382_reclaim/m07_the_drawing_leaves_the_placeholder_up.patch
diff --git a/data/setup.js b/data/setup.js
--- a/data/setup.js
+++ b/data/setup.js
@@ -429,7 +429,6 @@
 
   const showBoardArt = () => {
     if (boardImage) boardImage.classList.add("hidden");
-    if (boardPlaceholder) boardPlaceholder.classList.add("hidden");
     boardArt.classList.remove("hidden");
   };
 
