test/test_web/mutations_382_reclaim/m09_the_drawing_points_at_the_board_id.patch
diff --git a/data/setup.js b/data/setup.js
--- a/data/setup.js
+++ b/data/setup.js
@@ -457,7 +457,7 @@
     if (boardArt && boardArtUse && document.getElementById(`art-${productId}`)) {
       // Drawn from the page's own sprite: nothing is fetched, so the
       // deferred-asset gate below has nothing to hold back.
-      boardArtUse.setAttribute("href", `#art-${productId}`);
+      boardArtUse.setAttribute("href", `#art-${boardId}`);
       boardArt.setAttribute("aria-label", `${boardLabel} PCB`);
       showBoardArt();
       return;
