test/test_web/mutations_397/m1_tab_key_drops_the_page.patch
diff --git i/data/sound.js w/data/sound.js
index 3e35f4d5..bbae5a68 100644
--- i/data/sound.js
+++ w/data/sound.js
@@ -1326,7 +1326,7 @@
   const catalogBankPageKey = (bank, page) => {
     const bankNumber = Number.parseInt(String(bank ?? "0"), 10);
     const pageLetter = String(page ?? "A").trim().toUpperCase() || "A";
-    return `${Number.isFinite(bankNumber) ? bankNumber : 0}:${pageLetter}`;
+    return `${Number.isFinite(bankNumber) ? bankNumber : 0}`;
   };
 
   const renderCatalogBankTabs = () => {
