test/test_web/mutations_397/m2_filter_ignores_the_page.patch
diff --git i/data/sound.js w/data/sound.js
index 3e35f4d5..9bce6752 100644
--- i/data/sound.js
+++ w/data/sound.js
@@ -1364,7 +1364,8 @@
   const getVisibleCatalogEntries = () => {
     const query = catalogFilterInput?.value?.trim().toLowerCase() ?? "";
     return catalogEntries.filter((entry) => {
-      if (catalogBankFilter && catalogBankPageKey(entry?.bank, entry?.page) !== catalogBankFilter) {
+      if (catalogBankFilter &&
+          String(Number.parseInt(String(entry?.bank ?? "0"), 10)) !== catalogBankFilter.split(":")[0]) {
         return false;
       }
       if (!query) return true;
