test/test_web/mutations_397/m3_ready_counts_as_this_refresh.patch
diff --git i/data/sound.js w/data/sound.js
index 3e35f4d5..15036c88 100644
--- i/data/sound.js
+++ w/data/sound.js
@@ -1662,8 +1662,8 @@
       for (let attempt = 0; attempt < CATALOG_REFRESH_MAX_POLLS; attempt += 1) {
         await new Promise((resolve) => window.setTimeout(resolve, 1000));
         await loadCatalog();
-        if (catalogRefreshStatus.settled >= requestId) {
-          return reportRefreshOutcome(catalogRefreshStatus.state);
+        if (catalogReady) {
+          return reportRefreshOutcome("completed");
         }
         if (catalogRefreshStatus.request > requestId) {
           showFeedback(catalogFeedback,
