test/test_web/mutations_397/m5_an_old_listing_is_not_labelled.patch
diff --git i/data/sound.js w/data/sound.js
index 3e35f4d5..8fc9519e 100644
--- i/data/sound.js
+++ w/data/sound.js
@@ -1627,7 +1627,7 @@
       renderCatalogLimits();
       return false;
     }
-    catalogStale = !outcome.ok && catalogReady;
+    catalogStale = false;
     renderCatalogLimits();
     showFeedback(catalogFeedback, outcome.text, outcome.ok);
     return outcome.ok;
