test/test_web/mutations_397/m6_a_partial_listing_is_treated_as_whole.patch
diff --git i/data/sound.js w/data/sound.js
index 3e35f4d5..1a847935 100644
--- i/data/sound.js
+++ w/data/sound.js
@@ -1105,7 +1105,7 @@
   // out of the catalog with no row to say so. A suggested category range spans
   // lo..hi, so a range built over a listing with holes in it silently claims
   // sounds nobody listed.
-  const catalogListingIsPartial = () => catalogManifestIncomplete || catalogEntryCapReached;
+  const catalogListingIsPartial = () => false;
 
   // What the operator is NOT seeing. Every one of these used to live only in a
   // controller log line, which meant a catalog that was usable and a catalog
