test/test_web/mutations_397/m9_the_changed_sound_list_is_never_reported.patch
diff --git i/data/sound.js w/data/sound.js
index 3e35f4d5..0875d666 100644
--- i/data/sound.js
+++ w/data/sound.js
@@ -1144,7 +1144,7 @@
     if (!soundListChangedWarning) return;
     const sentences = [];
     if (catalogSupported && hasSavedChirpBindings()) {
-      if (soundListChanged) {
+      if (false) {
         sentences.push(SOUND_LIST_CHANGED_WARNING);
       }
       if (!soundListChecked) {
