test/test_web/mutations_399/m3-chip-value-over-label.patch
diff --git i/data/shell.js w/data/shell.js
index f6f423a4..74b4ae07 100644
--- i/data/shell.js
+++ w/data/shell.js
@@ -637,8 +637,8 @@
     // an instrument uses, where the label is the engraving on the panel and the
     // value is what the needle says (ADR 0066).
     const inner =
-      `<span class="status-chip-label">${chip.label}</span>` +
-      `<span class="status-chip-value"><span class="status-chip-dot"></span>${CHIP_UNKNOWN}</span>`;
+      `<span class="status-chip-value"><span class="status-chip-dot"></span>${CHIP_UNKNOWN}</span>` +
+      `<span class="status-chip-label">${chip.label}</span>`;
     const shared = `class="status-chip" id="chip-${chip.id}" data-chip="${chip.id}" title="${chipAffordance(chip)}"`;
     return chip.page === null
       ? `<button type="button" ${shared}>${inner}</button>`
