test/test_web/mutations_399/m6-sleep-read-off-stationary.patch
diff --git i/data/app.js w/data/app.js
index 97f3ee16..c117d34c 100644
--- i/data/app.js
+++ w/data/app.js
@@ -353,7 +353,7 @@
   const renderMissionSnapshot = (payload) => {
     const modeText = payload.stationary ? "Stationary" : "Driving";
     const moodText = MOOD_LABELS[payload.activeMood] || `Mood ${payload.activeMood || 0}`;
-    const sleepText = payload.sleepMode ? "asleep" : "awake";
+    const sleepText = payload.stationary ? "asleep" : "awake";
 
     setText(snapshotMode, modeText);
     setText(snapshotMood, moodText);
