test/test_web/mutations_399/m9-droid-build-second-fetch.patch
diff --git i/data/app.js w/data/app.js
index 97f3ee16..5d1151dd 100644
--- i/data/app.js
+++ w/data/app.js
@@ -896,7 +896,7 @@
     // already holds, and the controller sheds connections under load, so a
     // second GET of the same document would cost a client slot to learn what
     // this one already said.
-    renderDroidBuild(window.DroidBuild?.adopt(result.data) || null);
+    window.DroidBuild?.load().then((build) => renderDroidBuild(build || null));
     const level = Number(result.data?.system?.logLevel);
     if (!LOG_LEVELS[level]) {
       throw new Error(`Unknown log level: ${level}`);
