test/test_web/mutations_399s2/m02-every-aux-line-counts-as-a-servo.patch
diff --git i/data/servo.js w/data/servo.js
index 4c0ffb75..0560b8d7 100644
--- i/data/servo.js
+++ w/data/servo.js
@@ -204,7 +204,7 @@
   // on and has no position, so the second count is smaller on purpose.
   const auxSummary = (enabled) => {
     if (enabled.length === 0) return "none switched on";
-    const drivable = enabled.filter((aux) => isServoType(auxTypes[aux.id])).length;
+    const drivable = enabled.length;
     return `${enabled.length} of ${AUX_DEFS.length} switched on · ${drivable} ${
       drivable === 1 ? "drives a servo" : "drive a servo"
     }`;
