test/test_web/mutations_399s2/m04-the-counts-leave-the-section-head.patch
diff --git i/data/parts.js w/data/parts.js
index eca09ac9..8ca83f33 100644
--- i/data/parts.js
+++ w/data/parts.js
@@ -204,10 +204,10 @@
     // else (ADR 0066): a heading carries a count and never appears bare, and
     // the counts live in one place rather than beside a total that restates
     // them. #293's honesty tiers are what a builder counts this table by.
-    `<div class="sect"><h2>Outputs</h2>` +
-    `<span class="sub outputs-tiers" role="status" aria-live="polite">` +
+    `<div class="sect"><h2>Outputs</h2></div>` +
+    `<p class="outputs-tiers" role="status" aria-live="polite">` +
     TIERS.map((tier) => `<span class="outputs-tier" data-tier="${tier.id}">${tier.label} — finding out</span>`).join("") +
-    `</span></div>` +
+    `</p>` +
     `<p class="prose">Every output on the controller, in the order the leads plug in, with every part on it - ` +
     `a lead split to two doors names both. Pick a part in a row to put it on that output; if the part is on ` +
     `another output, this page asks before it moves it.</p>` +
