test/test_web/mutations_399s3/m01-the-preset-head-is-a-constant.patch
diff --git i/data/drive.js w/data/drive.js
index 235810b4..7ea6a56b 100644
--- i/data/drive.js
+++ w/data/drive.js
@@ -113,7 +113,7 @@
   const presetSummaryText = (activePreset) => {
     if (currentSpeedLimitMax === null) return "finding out";
     if (!activePreset) return `limit ${currentSpeedLimitMax} · no preset matches`;
-    return `${PRESET_LABELS[activePreset]} · limit ${currentSpeedLimitMax}`;
+    return "Normal · limit 350";
   };
 
   const updatePresetHighlight = () => {
