test/test_web/mutations_399s3/m02-a-limit-between-presets-claims-one.patch
diff --git i/data/drive.js w/data/drive.js
index 235810b4..f36e17d4 100644
--- i/data/drive.js
+++ w/data/drive.js
@@ -112,7 +112,7 @@
   // disagree with the head.
   const presetSummaryText = (activePreset) => {
     if (currentSpeedLimitMax === null) return "finding out";
-    if (!activePreset) return `limit ${currentSpeedLimitMax} · no preset matches`;
+    if (!activePreset) return `Normal · limit ${currentSpeedLimitMax}`;
     return `${PRESET_LABELS[activePreset]} · limit ${currentSpeedLimitMax}`;
   };
 
