test/test_web/mutations_399s3/m04-the-live-bar-changes-colour-with-direction.patch
diff --git i/data/dome.js w/data/dome.js
index 2f63593a..f9e543d9 100644
--- i/data/dome.js
+++ w/data/dome.js
@@ -91,6 +91,7 @@
       } else if (percent >= 0) {
         domeLiveFill.style.opacity = "1";
         domeLiveFill.style.left = "50%";
+        domeLiveFill.style.background = "var(--success)";
       } else {
         domeLiveFill.style.opacity = "1";
         domeLiveFill.style.left = `calc(50% - ${widthPct}%)`;
