test/test_web/mutations_399s3/m12-a-step-card-carries-a-glyph-again.patch
diff --git i/data/seq.js w/data/seq.js
index 246c7ff9..b9462df0 100644
--- i/data/seq.js
+++ w/data/seq.js
@@ -628,6 +628,7 @@
         <span class="step-handle" title="Drag to reorder steps">⋯</span>
         <span class="step-number-label">Step ${idx + 1}</span>
         <span class="step-time-label">t=${step.t || 0}ms</span>
+        <span class="step-card-emoji">\u{1F50A}</span>
         <span class="step-card-type">${window.PAUtils.escapeHtml(typeName)}</span>
         <span class="step-card-preview">${window.PAUtils.escapeHtml(preview)}</span>
         ${isInvalid ? `<span class="step-card-error-badge" aria-hidden="true">!</span>` : ""}
