test/test_web/mutations_399s3/m13-the-editor-head-counts-a-constant.patch
diff --git i/data/seq.js w/data/seq.js
index 246c7ff9..e4389e67 100644
--- i/data/seq.js
+++ w/data/seq.js
@@ -1301,7 +1301,7 @@
 
     els.editorView.innerHTML = `
       <div class="card">
-        <div class="sect"><h2>Editing</h2><span class="sub">${window.PAUtils.escapeHtml(seq.name || "a new sequence")} &middot; ${seq.steps.length} ${seq.steps.length === 1 ? "step" : "steps"}</span></div>
+        <div class="sect"><h2>Editing</h2><span class="sub">${window.PAUtils.escapeHtml(seq.name || "a new sequence")} &middot; 5 steps</span></div>
         ${tuneNotice}
 
         <div class="seq-editor-metadata">
