test/test_web/mutations_399s3/m15-the-sprite-drops-the-arrow-the-pad-draws.patch
diff --git i/data/shell.js w/data/shell.js
index a097fef0..1cf59979 100644
--- i/data/shell.js
+++ w/data/shell.js
@@ -96,7 +96,7 @@
     // #398 reference committed, so forward and reverse are this horizontal
     // arrow turned a quarter in the stylesheet rather than two more paths taken
     // from a package nobody in this slice read (docs/icon-set-provenance.md).
-    "arrow-left": "M20,11V13H8L13.5,18.5L12.08,19.92L4.16,12L12.08,4.08L13.5,5.5L8,11H20Z",
+
     "arrow-right": "M4,11V13H16L10.5,18.5L11.92,19.92L19.84,12L11.92,4.08L10.5,5.5L16,11H4Z",
   };
 
