test/test_web/mutations_399s4/m03-apply-head-never-says-anything-is-staged.patch
diff --git i/data/wifi.js w/data/wifi.js
index c4638920..76bb6813 100644
--- i/data/wifi.js
+++ w/data/wifi.js
@@ -111,9 +111,7 @@
     if (applyState) {
       applyState.textContent = state.rebootRequestPending
         ? "reboot requested"
-        : state.wifiConfig?.pendingApply
-          ? "staged, waiting for a reboot"
-          : "nothing staged";
+        : "nothing staged";
     }
   };
 
