test/test_web/mutations_399s4/m04-signal-thresholds-swap-good-and-fair.patch
diff --git i/data/wifi.js w/data/wifi.js
index c4638920..1e6f3606 100644
--- i/data/wifi.js
+++ w/data/wifi.js
@@ -75,7 +75,7 @@
     const value = Number(rssi || 0);
     if (!value) return "—";
     const strength =
-      value >= -67 ? "Excellent" : value >= -75 ? "Good" : value >= -85 ? "Fair" : "Poor";
+      value >= -67 ? "Excellent" : value >= -75 ? "Fair" : value >= -85 ? "Good" : "Poor";
     return `${strength} · ${value} dBm`;
   };
 
