test/test_web/mutations_399s4/m06-the-posture-head-is-painted-again.patch
diff --git i/data/wifi.js w/data/wifi.js
index c4638920..f7b9c8a0 100644
--- i/data/wifi.js
+++ w/data/wifi.js
@@ -123,6 +123,7 @@
   // twice (ADR 0066, CONTEXT.md "Status Colour").
   const setPendingSummary = (text) => {
     if (!pendingSummary) return;
+    pendingSummary.className = "status-pill pill-ok status-pill-compact";
     pendingSummary.textContent = text;
   };
 
