test/test_web/mutations_399s4/m07-the-web-ui-upload-answers-on-the-wrong-plate.patch
diff --git i/data/firmware.js w/data/firmware.js
index c4034b5b..36161351 100644
--- i/data/firmware.js
+++ w/data/firmware.js
@@ -204,7 +204,7 @@
   };
 
   const uploadFilesystem = () => {
-    const target = fsFeedback || feedback;
+    const target = feedback;
     const file = fsFile && fsFile.files && fsFile.files[0];
     if (!file) {
       target.textContent = "Select a filesystem .bin file first.";
