test/test_web/mutations_399s4/m08-the-reboot-answers-on-the-wrong-plate.patch
diff --git i/data/firmware.js w/data/firmware.js
index c4034b5b..ad27888b 100644
--- i/data/firmware.js
+++ w/data/firmware.js
@@ -111,7 +111,7 @@
   };
 
   const postReboot = async () => {
-    const target = rebootFeedback || feedback;
+    const target = feedback;
     if (!window.PAApi) {
       target.textContent = "API helper unavailable";
       return;
