test/test_web/mutations_399s4/m11-a-mood-nobody-sent-is-mood-zero-again.patch
diff --git i/data/app.js w/data/app.js
index 3d43edc5..2da307c2 100644
--- i/data/app.js
+++ w/data/app.js
@@ -357,7 +357,7 @@
     // "Mood 0" beside two readouts that say "Not reported" for the same thing.
     // It is also the only place on this surface a raw number would reach the
     // operator, which ADR 0059 keeps behind the mapping table above.
-    const moodText = MOOD_LABELS[payload.activeMood] || "Not reported";
+    const moodText = MOOD_LABELS[payload.activeMood] || `Mood ${payload.activeMood || 0}`;
     const sleepText = payload.sleepMode ? "asleep" : "awake";
 
     setText(snapshotMode, modeText);
