test/test_web/mutations_400/m01_the_recorded_open_end_is_ignored.patch
diff --git i/data/servo.js w/data/servo.js
index bec211e0..a11676e8 100644
--- i/data/servo.js
+++ w/data/servo.js
@@ -288,7 +288,8 @@
       const cfg = result.data;
 
       // Arm ends
-      endpoints.arm1Open  = cfg.arm1OpenUs  ?? 2000;
+      endpoints.arm1Open  = 2000;
+
       endpoints.arm1Close = cfg.arm1CloseUs ?? 1000;
       endpoints.arm2Open  = cfg.arm2OpenUs  ?? 2000;
       endpoints.arm2Close = cfg.arm2CloseUs ?? 1000;
