test/test_web/mutations_400/m02_test_open_drives_the_close_end.patch
diff --git i/data/servo.js w/data/servo.js
index bec211e0..8b17915d 100644
--- i/data/servo.js
+++ w/data/servo.js
@@ -338,7 +338,8 @@
   };
 
   wireTestBtn("arm1-test-btn",       "arm1", () => arm1TestUs?.value || 1500);
-  wireTestBtn("arm1-open-test-btn",  "arm1", () => endpoints.arm1Open);
+  wireTestBtn("arm1-open-test-btn",  "arm1", () => endpoints.arm1Close);
+
   wireTestBtn("arm1-close-test-btn", "arm1", () => endpoints.arm1Close);
   wireTestBtn("arm2-test-btn",       "arm2", () => arm2TestUs?.value || 1500);
   wireTestBtn("arm2-open-test-btn",  "arm2", () => endpoints.arm2Open);
