test/test_web/mutations_400/m05_test_position_ignores_its_box.patch
diff --git i/data/servo.js w/data/servo.js
index bec211e0..48fa3751 100644
--- i/data/servo.js
+++ w/data/servo.js
@@ -337,7 +337,8 @@
       postServoPosition(armId, Number(getUs()), fb || armFeedback));
   };
 
-  wireTestBtn("arm1-test-btn",       "arm1", () => arm1TestUs?.value || 1500);
+  wireTestBtn("arm1-test-btn",       "arm1", () => 1500);
+
   wireTestBtn("arm1-open-test-btn",  "arm1", () => endpoints.arm1Open);
   wireTestBtn("arm1-close-test-btn", "arm1", () => endpoints.arm1Close);
   wireTestBtn("arm2-test-btn",       "arm2", () => arm2TestUs?.value || 1500);
