test/test_web/mutations_400/m06_the_forwarder_names_a_page_that_is_not_there.patch
diff --git i/data/servo.html w/data/servo.html
index 93a4fe7e..29f1b927 100644
--- i/data/servo.html
+++ w/data/servo.html
@@ -53,7 +53,8 @@
       <h3>Test a servo</h3>
       <div class="desc">
         Move one servo now, without changing anything. Open and close ends are set in
-        <a class="setup-link" href="/parts.html">Parts</a>: press Calibrate on the output that
+        <a class="setup-link" href="/servos.html">Parts</a>
+: press Calibrate on the output that
         drives the part and drive it to each end.
       </div>
 
