test/test_web/mutations_400/m07_servos_leaves_the_configure_group.patch
diff --git i/data/shell.js w/data/shell.js
index 36fa6869..ce55c29d 100644
--- i/data/shell.js
+++ w/data/shell.js
@@ -161,8 +161,8 @@
         // operator answered it on 2026-09-16: take out its calibration form,
         // keep the page. It now holds only what it is actually for -- driving
         // an arm, driving an AUX servo -- and an end is set on Parts (#400).
-        "servo",
         "parts",
+
         "wiring", // dormant until C2a (#350)
       ],
     },
