test/test_web/mutations_402/m1-wifi-not-joined-reads-degraded.patch
diff --git i/data/health_signals.js w/data/health_signals.js
index 52bb348e..ffbbe4b9 100644
--- i/data/health_signals.js
+++ w/data/health_signals.js
@@ -76,7 +76,7 @@
     const rssiText = Number.isFinite(wifiRssi) ? `${wifiRssi} dBm` : "unknown";
     const detail = `wifiConnected=${boolText(payload.wifiConnected)}, wifiClientConnected=${boolText(payload.wifiClientConnected)}, wifiRssi=${rssiText}`;
     if (connected) return healthSignal("ok", "Connected", detail);
-    if (reported) return healthSignal("off", "Not joined", detail);
+    if (reported) return healthSignal("warn", "Not joined", detail);
     return healthSignal("off", "Not reporting", detail);
   };
 
