test/test_web/mutations_402/m2-dome-esc-unknown-state-reads-degraded.patch
diff --git i/data/health_signals.js w/data/health_signals.js
index 52bb348e..44a18bf6 100644
--- i/data/health_signals.js
+++ w/data/health_signals.js
@@ -259,7 +259,7 @@
     // the tooltip still says what arrived.
     if (typeof domeState === "string" && domeState.length > 0) {
       return healthSignal(
-        "off",
+        "warn",
         `Unknown (${domeState})`,
         `domeEnabled=true, state=${domeState}, detail=${domeDetail}`
       );
