test/test_web/mutations_402/m3-fs-treats-silence-as-a-mount-failure.patch
diff --git i/data/health_signals.js w/data/health_signals.js
index 52bb348e..01871d1e 100644
--- i/data/health_signals.js
+++ w/data/health_signals.js
@@ -84,9 +84,6 @@
   // failed; it has told us nothing. Red is "stopped or refused", and claiming
   // it for a key we were never sent is the same defect as claiming amber.
   const evaluateFilesystem = (payload) => {
-    if (!hasOwnKey(payload, "littleFsReady")) {
-      return healthSignal("off", "Not reporting", "littleFsReady absent from payload");
-    }
     return payload.littleFsReady === true
       ? healthSignal("ok", "Mounted", "littleFsReady=true")
       : healthSignal("fail", "Not ready", `littleFsReady=${boolText(payload.littleFsReady)}`);
