test/test_web/mutations_402/m5-dome-link-never-seen-reads-degraded.patch
diff --git i/data/health_signals.js w/data/health_signals.js
index 52bb348e..36cecd61 100644
--- i/data/health_signals.js
+++ w/data/health_signals.js
@@ -169,7 +169,7 @@
     // fitted reads exactly this, and it is not worth getting up for. "lost"
     // above stays a hard fault: that one WAS heard and then stopped.
     if (linkState === "not_seen") {
-      return healthSignal("off", "Not seen", `state=not_seen, detail=${linkDetail}`);
+      return healthSignal("warn", "Not seen", `state=not_seen, detail=${linkDetail}`);
     }
     if (typeof linkState === "string" && linkState.length > 0) {
       return healthSignal(
