test/test_web/mutations_402/m6-blocked-sound-rx-reads-degraded.patch
diff --git i/data/health_signals.js w/data/health_signals.js
index 52bb348e..c96b5d25 100644
--- i/data/health_signals.js
+++ w/data/health_signals.js
@@ -206,7 +206,7 @@
     // definition of not reporting; it is still not a module failure, which is
     // why this branch sits above the link_ok=false hard fault below.
     if (soundRxStatus === "blocked_by_dome_uart") {
-      return healthSignal("off", "Status unavailable", soundRxDetail);
+      return healthSignal("warn", "Status unavailable", soundRxDetail);
     }
 
     if (payload.audio.link_ok === false) {
