test/test_web/mutations_402/m8-stale-banner-never-shows.patch
The name is #402's and the file keeps it, because a rename here reads to the
slice gate as a deleted test. What it defends has moved: #399 removed the
Dashboard's stale banner, which said the same thing as the Status Plate's one
freshness line in a second aria-live region on the same screen. The claim is now
the plate's line, so this reverts THAT rather than setStale, which no longer
exists. Killed by test_status_plate_346.js, which boots the shipped shell.

diff --git i/data/shell.js w/data/shell.js
index a097fef0..0146d006 100644
--- i/data/shell.js
+++ w/data/shell.js
@@ -1035,9 +1035,7 @@
     // on a reconnect that is already running, and a blank plate would be the
     // presentation they meet most often (#324, #327).
     plateRegion.dataset.freshness = plateStreamBroken ? "finding-out" : "live";
-    plateFreshness.textContent = plateStreamBroken
-      ? `${heard} Reconnecting - these are the values it last sent.`
-      : heard;
+    plateFreshness.textContent = heard;
   };
 
   const notePlateStatus = (payload) => {
